Repository: stratej-fr/erlond-doc-fr
Catalog: xliff_erlond-white-paper_elrond-whitepaperdocx_*.xlf
Languages: fr

source: Delegated Proof of Stake (DPoS) found in Bitshares [21], Steemit [22] and EOS [23] is a hybrid between Proof of Authority and Proof of Stake in which the few nodes respon- sible for deploying new blocks are elected by stakeholders. Although it has a high throughput, the model is susceptible to human related social problems such as bribing and corruption. Also, a small number of delegates makes the system prone to DDoS attacks and centralization.
fr: La preuve d'autorité déléguée (Delegated Proof of Stake - DPoS), que l'on trouve dans Bitshares [21], Steemit [22] et EOS [23], est un hybride entre la preuve d'autorité et la preuve d'enjeu, dans lequel les quelques nœuds responsables du déploiement de nouveaux blocs sont élus par les parties prenantes. Bien que présentant un débit élevé, le modèle est sensible aux problèmes sociaux spécifiques à l'homme tels que la corruption. De plus, un petit nombre de délégués rend le système vulnérable aux attaques DDoS et à la centralisation.

source: 2 Secure Proof of Stake (SPoS)
fr: 2 Preuve d'enjeu sécurisée (SPoS = Secure Proof of Stake)

source: Elrond’s approach to consensus is made by combining random validators’ selection, eligibility through stake and rating, with an optimal dimension for the consensus group. The algorithm is described in the steps below:
fr: L'approche d'Elrond en matière de consensus consiste à combiner la sélection aléatoire des validateurs, l'éligibilité à travers l'enjeu et de la notation, avec une dimension optimale pour le groupe de consensus. L'algorithme est décrit dans les étapes ci-dessous :

source: 1) Each node ni is defined as a tuple of public key (P k), rating (default is 0) and the locked stake. If ni wishes to participate in the consensus, it has to first register through a smart contract, by sending a transaction that contains an amount equal to the minimum required stake and other information (P ks, a public key derived from P k and nodeid that will be used for the signing process in order not to use a real wallet address).
fr: 1) Chaque nœud ni est défini comme un tuple de clé publique (P k), de notation (par défaut 0) et l'enjeu verrouillé. Si ni souhaite participer au consensus, il doit d'abord s'enregistrer par le biais d'un contrat intelligent, en envoyant une transaction qui contient un montant égal à l'enjeu minimal requis et d'autres informations (P ks, une clé publique dérivée de P k et un nodeid qui sera utilisé pour le processus de signature afin de ne pas utiliser une adresse réelle de portefeuille).

source: 2) The node ni joins the node pool and waits for the shard assignment at the end of the current epoch e. The shard assignment mechanism creates a new set of nodes containing all the nodes that joined in epoch e and all 33the nodes that need to be reshuffled (less than 1 of every shard). All nodes in this set will be reassigned to the waiting lists of shards. Wj represents j’s shard waiting list and Nsh represents the number of shards. A node also has a secret key sk that by nature is not to be made public.
fr: 2) Le nœud ni rejoint le pool de nœuds et attend l'affectation des shards à la fin de l'époque e en cours. Le mécanisme d'affectation des shards crée un nouvel ensemble de nœuds contenant tous les nœuds qui se sont joints à l'époque e et tous les 33 nœuds qui doivent être remélangés (moins de 1 de chaque shards). Tous les nœuds de cet ensemble seront réaffectés aux listes d'attente de shards. Wj représente la liste d'attente de shards de j et Nsh représente le nombre de shards. Un nœud possède également une clé secrète sk qui, par nature, ne doit pas être rendue publique.

source: 3) At the end of the epoch in which it has joined, the node will be moved to the list of eligible nodes (Ej ) of a shard j, where e is the current epoch.
fr: 3) À la fin de l'époque il s'est joint, le nœud sera déplacé vers la liste des nœuds éligibles (Ej) d'un shard j, où e est l'époque courante.

source: 4) Each node from the list Ej can be selected as part of an optimally dimensioned consensus group (in terms of security and communication), by a deterministic function, based on the randomness source added to the previous block, the round r and a set of variation parameters. The random number, known to all shard nodes through gossip, cannot be predicted before the block is actually signed by the previous consensus group. This property makes it a good source of randomness and prevents highly adaptive malicious attacks. We define a selection function to return the set of chosen nodes (consensus group) Nchosen with the first being the block proposer, that takes following parameters: E, r and sigr−1 - the previous block signature.
fr: 4) Chaque nœud de la liste Ej peut être sélectionné dans le cadre d'un groupe de consensus dimensionné de manière optimale (en termes de sécurité et de communication), par une fonction déterministe, basée sur le caractère aléatoire de la source ajoutée au bloc précédent, le tour r et un ensemble de paramètres de variation. Le nombre aléatoire, connu de tous les nœuds du shard par le biais d'un protocole de bavardage, ne peut être prédit avant que le bloc ne soit effectivement signé par le groupe de consensus précédent. Cette propriété en fait une bonne source aléatoire et empêche les attaques malveillantes hautement adaptatives. Nous définissons une fonction de sélection pour renvoyer l'ensemble des nœuds choisis (groupe de consensus) Nchosen, le premier étant le proposant du bloc, qui prend les paramètres suivants : E, r et sigr-1 - la signature du bloc précédent.

source: Nchosen = f(E, r, sigr−1), where Nchosen ⊂ E
fr: Nchoisi = f (E, r, sigr−1), où Nchoisi E

source: 5) The block will be created by the block proposer and the validators will co-sign it based on a modified practical Byzantine Fault Tolerance (pBFT).
fr: 5) Le bloc sera créé par le proposant de bloc et les validateurs le cosigneront sur la base du protocole "practical Byzantine Fault Tolerance" (PbFt).

source: 6) If, for any reason, the block proposer did not create a block during its allocated time slot (malicious, offline, etc.), round r will be used together with the randomness source from the last block to select a new consensus group.
fr: 6) Si, pour une raison quelconque, le proposant de bloc n'a pas créé de bloc pendant le créneau horaire qui lui était attribué (malveillant, hors ligne, etc.), le tour r sera utilisé en conjugaison avec la source aléatoire du dernier bloc pour sélectionner un nouveau groupe de consensus.

source: If the current block proposer acts in a malicious way, the rest of the group members apply a negative feedback to change its rating, decreasing or even cancelling out the chances that this particular node will be selected again. The feedback function for the block proposer (ni) in round number r, with parameter ratingModifier ∈ Z is computed as:
fr: Si le proposant du bloc courant agit de manière malveillante, les autres membres du groupe émettront un retour négatif pour dégrader son classement, diminuant ou même annulant les chances que ce nœud particulier soit à nouveau sélectionné. La fonction de rétroaction pour le proposant de bloc (ni) dans le tour numéro r, avec le paramètre ratingModifier ∈ Z est calculée comme suit :

source: feedbackfunction = ff(ni, ratingModifier, r)
fr: feedbackfunction = ff (ni, notationModificateur, r)

source: 33the nodes that need to be reshuffled (less than 1 of every shard). All nodes in this set will be reassigned to the waiting lists of shards. Wj represents j’s shard waiting list and Nsh represents the number of shards. A node also has a secret key sk that by nature is not to be made public.
fr: < problème >

source: When ratingModifier < 0, slashing occurs so the node ni loses its stake.
fr: Lorsque RatingModifier < 0, une coupure se produit de sorte que le nœud ni perde sa mise.

source: The consensus protocol remains safe in the face of DDoS attacks by having a high number of possible validators from the list E (hundreds of nodes) and no way to predict the order of the validators before they are selected.
fr: Le protocole de consensus reste sûr face aux attaques DDoS dans la mesure où il peut s'appuyer sur un nombre élevé de validateurs possibles existants dans la liste E (centaines de nœuds) et dans la mesure ou il n'y a aucun moyen de prédire l'ordre des validateurs avant qu'ils ne soient sélectionnés.

source: To reduce the communication overhead that comes with an increased number of shards, a consensus will be run on a composite block. This composite block is formed by:
fr: Pour réduire le cout additionnel de communication qui accompagne un nombre accru de shards, un consensus sera exécuté sur un bloc composite. Ce bloc composite est formé par :

source: • Ledger block: the block to be added into the shard’s ledger, having all intra shard transactions and cross shard transactions for which confirmation proof was received;
fr: • Le bloc registre : le bloc à ajouter dans le registre du shard, comportant toutes les transactions intra shard ainsi que toutes les transactions inter shards pour lesquelles une preuve de confirmation a été reçue;

source: • Multiple mini-blocks: each of them holding cross shard transactions for a different shard;
fr: • Mini-blocs multiples : chacun d'eux détenant des transactions inter shards pour un shard différent ;

source: The consensus will be run only once, on the composite block containing both intra- and cross-shard transactions. After consensus is reached, the block header of each shard is sent to the metachain for notarization.
fr: Le consensus ne sera exécuté qu'une seule fois, sur le bloc composite contenant les transactions à la fois intra- et inter-shards. Une fois le consensus obtenu, l'en-tête de bloc de chaque shard est envoyé à la métachaîne pour notarisation

source: VI Cryptographic Layer
fr: VI La couche cryptographique

source: 1 Signature Analysis
fr: 1 Analyse des signatures

source: Digital signatures are cryptographic primitives used to achieve information security by providing several properties like message authentication, data integrity and non-repudiation [24].
fr: Les signatures numériques sont des cryptographiques primitif utilisées pour assurer la sécurité de l'information en offrant plusieurs propriétés comme l'authentification du message, l'intégrité des données et la non-répudiation [24].

source: Most of the schemes used for existing blockchain platforms rely on the discrete logarithm (DL) problem: one-way expo- nentiation function y → αymod p. It is scientifically proven that calculating the discrete logarithm with base is hard [25]. Elliptic curve cryptography (ECC) uses a cyclic group of points instead of a cyclic group of integers. The scheme reduces the computational effort, such that for key lengths of only 160 - 256 bits, ECC provides same security level that RSA, Elgamal, DSA and others provide for key lengths of1024 - 3072 bits (see Table 1 [24]).
fr: La plupart des schémas utilisés pour les plates-formes blockchaine existantes reposent sur le problème du logarithme discret (DL) : fonction d’exponentialliter unidirectionnelle y → αymod p. Il est scientifiquement prouvé que le calcul du logarithme discret avec base est difficile [25]. La cryptographie à courbe elliptique (ECC) utilise un groupe cyclique de points au lieu d'un groupe cyclique d'entiers. Ce système réduit l'effort de calcul, de sorte que pour des longueurs de clé de seulement 160 à 256 bits, l'ECC offre le même niveau de sécurité que RSA, Elgamal, DSA et d'autres fournissent pour des longueurs de clé de 1024 à 3072 bits (voir tableau 1 [24]).

source: The reason why ECC provides a similar security level for much smaller parameter lengths is because existing attacks on elliptic curve groups are weaker than the existing integer DL attacks, the complexity of such algorithms require on average√p steps to solve. This means that an elliptic curve using a prime p of 256 bit length provides on average a security of
fr: La raison pour laquelle l'ECC offre un niveau de sécurité similaire pour des longueurs de paramètres beaucoup plus petites est que les attaques existantes sur des groupes de courbes elliptiques sont plus faibles que les attaques DL entières existantes, la complexité de ces algorithmes nécessitant une moyenne √p des étapes de résolution. Cela signifie qu'une courbe elliptique utilisant un p premier de 256 bits offre en moyenne un niveau de sécurité de

source: 2128 steps needed to break it [24].
fr: 2128 étapes nécessaires pour le briser [24].

source: Both Ethereum and Bitcoin use curve cryptography, with the ECDSA signing algorithm. The security of the algorithm is very dependent on the random number generator, because if the generator does not produce a different number on each query, the private key can be leaked [26].
fr: Ethereum et Bitcoin utilisent tous deux la cryptographie par courbe, avec l'algorithme de signature ECDSA. La sécurité de l'algorithme est très dépendante du générateur de nombres aléatoires, car si le générateur ne produit pas un nombre différent à chaque requête, la clé privée peut être perdue [26].

source: Another digital signature scheme is EdDSA, a Schnorr variant based on twisted Edwards curves that support fast arithmetic [27]. In contrast to ECDSA, it is provably non- malleable, meaning that starting from a simple signature, it is impossible to find another set of parameters that defines the same point on the elliptic curve [28], [29]. Additionally, EdDSA doesn’t need a random number generator because it uses a nonce, calculated as the hash of the private key and the message, so the attack vector of a broken random number generator that can reveal the private key is avoided.
fr: Un autre système de signature numérique est l'EdDSA, une variante de Schnorr basée sur des courbes Edwards qui permettent un calcul rapide [27]. Contrairement à l'ECDSA, il est prouvé qu'il est non malléable, ce qui signifie qu'à partir d'une simple signature, il est impossible de trouver un autre ensemble de paramètres qui définisse le même point sur la courbe elliptique [28], [29]. En outre, l'EdDSA n'a pas besoin d'un générateur de nombres aléatoires car il utilise un nonce, calculé comme le hachage de la clé privée et du message, ce qui permet d'éviter le vecteur d'attaque d'un générateur de nombres aléatoires brisé qui peut révéler la clé privée.

source: TABLE 1: Bit lengths of public-key algorithms for different security levels
fr: TABLEAU 1 : Longueur des bits des algorithmes à clé publique pour différents niveaux de sécurité

source: Schnorr signature variants are gaining more attention [8], [30] due to a native multi-signature capability and being provably secure in the random oracle model [31]. A multi- signature scheme is a combination of a signing and verification algorithms, where multiple signers, each with their own private and public keys, can sign the same message, producing a single signature [32], [33]. This signature can then be checked by a verifier which has access to the message and the public keys of the signers. A sub-optimal method would be to have each node calculate his own signature and then concatenate all results in a single string. However, such an approach is unfeasible as the generated string size grows with the number of signers. A practical solution would be to aggregate the output into a single fixed size signature, independent of the number of participants. There have been multiple proposals of such schemes, most of them are susceptible to rogue-key (cancellation) attacks. One solution for this problem would be to introduce a step where each signer needs to prove possession of the private key associated with its public key [34].
fr: Les variantes de signature de Schnorr attirent de plus en plus l'attention [8], [30] en raison de leur capacité multi-signature native et de leur sécurité prouvée dans le modèle de l'oracle aléatoire [31]. Un système multi-signature est une combinaison d'un algorithme de signature et de vérification, où plusieurs signataires, chacun avec ses propres clés privées et publiques, peuvent signer le même message, produisant une seule signature [32], [33]. Cette signature peut ensuite être vérifiée par un vérificateur qui a accès au message et aux clés publiques des signataires. Une méthode sous-optimale consisterait à demander à chaque nœud de calculer sa propre signature et de concaténer ensuite tous les résultats en une seule chaîne. Cependant, une telle approche est irréalisable car la taille de la chaîne générée augmente avec le nombre de signataires. Une solution pratique consisterait à agréger les résultats en une seule signature de taille fixe, indépendamment du nombre de participants. De tels systèmes ont été proposés à plusieurs reprises, la plupart d'entre eux étant susceptibles de faire l'objet d'attaques de type "rogue-key" (annulation). Une solution à ce problème serait d'introduire une étape où chaque signataire doit prouver la possession de la clé privée associée à sa clé publique [34].

source: Bellare and Neven [35] (BN) proposed a secure multi- signature scheme without a proof of possession, in the plain public key model, under the discrete logarithm assumption [31]. The participants commit first to their share Ri by prop- agating its hash to all other signers so they cannot calculate a function of it. Each signer computes a different challenge for their partial signature. However, this scheme sacrifices the public key aggregation. In this case, the verification of the aggregated signature, requires the public key from each signer. A recent paper by Gregory Maxwell et al. [29] proposes another multi-signature scheme in the plain public key model [36], under the ’one more discrete logarithm’ assumption (OMDL). This approach improves the previous scheme [35] by reducing the communication rounds from 3 to 2, reintroducing the key aggregation with a higher complexity cost.
fr: Bellare et Neven [35] (BN) ont proposé un système sécurisé à signatures multiples sans preuve de possession, dans le modèle à clé publique simple, sous l'hypothèse du logarithme discret [31]. Les participants s'engagent d'abord sur leur part de Ri en proposant son hachage à tous les autres signataires afin qu'ils ne puissent pas en calculer une fonction. Chaque signataire calcule un défi différent pour sa signature partielle. Toutefois, ce système sacrifie l'agrégation de la clé publique. Dans ce cas, la vérification de la signature agrégée nécessite la clé publique de chaque signataire. Un article récent de Gregory Maxwell et al (29) propose un autre schéma multi-signature dans le modèle de clé publique simple (36), sous l'hypothèse d'un "logarithme plus discret" (OMDL). Cette approche améliore le schéma précédent [35] en réduisant les cycles de communication de 3 à 2, réintroduisant l'agrégation de clés avec un coût de complexité plus élevé.

source: BLS [4] is another interesting signature scheme, from the Weil pairing, which bases its security on the Computational Diffie-Hellman assumption on certain elliptic curves and gen- erates short signatures. It has several useful properties like batch verification, signature aggregation, public key aggrega- tion, making BLS a good candidate for threshold and multi- signature schemes.
fr: BLS [4] est un autre schéma de signature intéressant, issu de l'appariement de Weil, qui fonde sa sécurité sur l'hypothèse de la différence de calcul de Hellman sur certaines courbes elliptiques et génère de courtes signatures. Il possède plusieurs propriétés utiles comme la vérification par lots, l'agrégation de signatures, l'agrégation de clés publiques, ce qui fait du BLS un bon candidat pour les systèmes à seuil et à signatures multiples.

source: Dan Boneh, Manu Drijvers and Gregory Neven recently proposed a BLS multi-signature scheme [5], using ideas from the previous work of [35], [30] to provide the scheme with defenses against rogue key attacks. The scheme supports efficient verification with only two pairings needed to verify a multi-signature and without any proof of knowledge of the secret key (works in the plain public key model). Another advantage is that the multi-signature can be created in only two communication rounds.
fr: Dan Boneh, Manu Drijvers et Gregory Neven ont récemment proposé un système multi-signature du BLS [5], utilisant des idées issues des travaux précédents [35], [30] pour fournir au système des défenses contre les attaques de clés malhonnêtes. Le système permet une vérification efficace avec seulement deux paires nécessaires pour vérifier une signature multiple et sans aucune preuve de la connaissance de la clé secrète (fonctionne dans le modèle de clé publique). Un autre avantage est que la multi-signature peut être créée en seulement deux cycles de communication.

source: For traceability and security reasons, a consensus based on a reduced set of validators requires the public key from each signer. In this context, our analysis concludes that the most appropriate multi-signature scheme for block signing in Elrond is BLS multi-signature [5], which is faster overall than the other options due to only two communication rounds.
fr: Pour des raisons de traçabilité et de sécurité, un consensus basé sur un ensemble réduit de validateurs exige la clé publique de chaque signataire. Dans ce contexte, notre analyse conclut que le schéma multi-signature le plus approprié pour la signature en bloc à Elrond est le BLS multi-signature [5], qui est globalement plus rapide que les autres options en raison de seulement deux cycles de communication.

source: 2 Block signing in Elrond
fr: 2 La signature de bloc dans Elrond

source: For block signing, Elrond uses curve cryptography based on the BLS multi-signature scheme over the bn256 bilinear group, which implements the Optimal Ate pairing over a 256- bit Barreto Naehrig curve. The bilinear pairing is defined as:
fr: Pour la signature de blocs, Elrond utilise une cryptographie de courbe basée sur le schéma multi-signature BLS sur le groupe bilinéaire bn256, qui met en œuvre l'appariement Optimal Ate sur une courbe Barreto Naehrig 256 bits. L’appariement bilinéaire est défini comme suit:

source: where g0, g1 and gt are elliptic curves of prime order p defined by bn256, and e is a bilinear map (i.e. pairing function). Let G0 and G1 be generators for g0 and g1. Also, let H0 be a hashing function that produces points on the curve g0:
fr: où g0, g1 et gt sont des courbes elliptiques d'ordre premier p définies par bn256, et e est une carte bilinéaire (c'est-à-dire une fonction d'appariement). Soit G0 et G1 sont les générateurs de g0 et g1. Soit également H0 une fonction de hachage qui produit des points sur la courbe g0 :

source: where M is the set of all possible binary messages of any length. The signing scheme used by Elrond employs a second hasing function as well, with parameters known by all signers:
fr: où M est l'ensemble de tous les messages binaires possibles, quelle que soit leur longueur. Le système de signature utilisé par Elrond utilise également une seconde fonction de hasing, dont les paramètres sont connus de tous les signataires :

source: H1 : M → Zp (3) Each signer i has its own private/public key pair (ski, P ki),
fr: H1 : M → Zp (3) Chaque signataire i a sa propre paire de clés privées/publiques (SKI, PKI),

source: where ski is randomly chosen from Zp. For each key pair, the property P ki = ski · G1 holds.
fr: où ski est choisi au hasard dans Zp. Pour chaque paire de clés, la propriété P ki = ski - G1 est retenue.
