Repository: stratej-fr/erlond-doc-fr
Catalog: xliff_erlond-white-paper_elrond-whitepaperdocx_*.xlf
Languages: fr

source: A Highly Scalable Public Blockchain via Adaptive State Sharding and Secure Proof of Stake
fr: Une Blockchain publique hautement scalable grâce au partitionnement horizontal (sharding) d'états adaptatif et au consensus à preuve d'enjeu sécurisée (Secure Proof of Stake - SPoS)

source: [Technical whitepaper — release 2 — revision 1]
fr: [Livre blanc technique - Edition 2 - révision 1]

source: Updated chapters: [5 - 13] June 19, 2019 - The Elrond Team https://www.elrond.com/
fr: mises à jour des chapitres: [5 - 13] 19 Juin 2019 – L’équipe Elrond https://www.elrond.com/

source: Abstract—The advent of secure public blockchains through Bitcoin and later Ethereum, has brought forth a notable degree of interest and capital influx, providing the premise for a global wave of permissionless innovation. Despite lofty promises, creating a decentralized, secure and scalable public blockchain has proved to be a strenuous task.
fr: Résumé - L'avènement de la Blockchain publique sécurisée avec Bitcoin puis Ethereum, a suscité un intérêt notable et l'afflux de capitaux, fournissant les prémisses d'une vague mondiale d'innovation ouverte à tous. Malgré de grandes promesses, la création d'une Blockchain décentralisée, sécurisée et évolutive s'est révélée être une tâche ardue.

source: This paper proposes Elrond, a novel architecture which goes beyond state of the art by introducing a genuine state sharding scheme for practical scalability, eliminating energy and computational waste while ensuring distributed fairness through a Secure Proof of Stake (SPoS) consensus. Having a strong focus on security, Elrond’s network is built to ensure resistance to known security problems like Sybil attack, Nothing at Stake attack and others. In an ecosystem that strives for interconnectivity, our solution for smart contracts offers an EVM compliant engine to ensure interoperability by design.
fr: Ce document est consacré à Elrond, une nouvelle architecture qui transcende l'état de l'art en introduisant un véritable mécanisme de partitionnement d'états (State Sharding) clé de voute d'une scalabilité opérationnelle, éliminant les gaspillages d'énergie et de calcul tout en garantissant une équité distribuée grâce à un consensus à preuve d'enjeu sécurisée (SPoS). En mettant l'accent sur la sécurité, le réseau d'Elrond est construit pour résister aux problèmes de sécurité connus comme l'attaque Sybil, l'attaque "Rien à perdre" et d'autres. Dans un écosystème qui prône l'interconnectivité, notre solution pour implémenter les contrats intelligents (Smart Contracts) offre un moteur compatible avec EVM afin d'inscrire l'interopérabilité dans son ADN.

source: Preliminary simulations and testnet results reflect that Elrond exceeds Visa’s average throughput and achieves an improvement beyond three orders of magnitude or 1000x compared to the existing viable approaches, while drastically reducing the costs of bootstrapping and storage to ensure long term sustainability.
fr: Les simulations préliminaires et les résultats du testnet montrent qu'Elrond dépasse le débit moyen de Visa en l'améliorant d'un facteur supérieur à 3, ou, d'un facteur 1000 par rapport aux approches viables existantes, tout en réduisant considérablement les coûts d'amorçage et de stockage pour assurer la durabilité à long terme.

source: 1 General aspects
fr: 1 Aspects généraux

source: Cryptocurrency and smart contract platforms such as Bit- coin and Ethereum have sparked considerable interest and have become promising solutions for electronic payments, decentralized applications and potential digital stores of value. However, when compared to their centralized counterparts in key metrics [1], the current state of affairs suggests that present public blockchain iterations exhibit severe limitations, particularly with respect to scalability, hindering their main- stream adoption and delaying public use. In fact, it has proved extremely challenging to deal with the current engineering boundaries imposed by the trade-offs in the blockchain trilemma paradigm [2]. Several solutions have been proposed, but few of them have shown significant and viable results. Thus, in order to solve the scalability problem, a complete rethinking of public blockchain infrastructures was required.
fr: Les plates-formes de crypto-monnaie et de contrats intelligents (Smart Contracts) telles que Bitcoin et Ethereum ont suscité un intérêt considérable et sont devenues des solutions prometteuses pour les paiements électroniques, les applications décentralisées et les réserves numériques potentielles de valeur. Toutefois, en comparaison des indicateurs clés de leurs homologues centralisés[1], l'état actuel des choses suggère que les versions actuelles des Blockchains publiques présentent de sérieuses limitations, notamment en ce qui concerne la scalabilité, ce qui fait obstacle à leur adoption par le grand public et lui en retarde son utilisation. En fait, il s'est avéré extrêmement difficile de gérer les limites techniques actuelles imposées par les compromis du paradigme du trilemme des Blockchains [2]. Plusieurs solutions ont été proposées, mais peu d'entre elles ont donné des résultats significatifs et viables. Ainsi, pour résoudre le problème de la scalabilité, il a fallu repenser complètement les infrastructures de la Blockchain publique.

source: 2 Defining the challenges
fr: 2 Définir les défis

source: Several challenges must be addressed properly in the pro- cess of creating an innovative public blockchain solution designed to scale:
fr: Plusieurs défis doivent être correctement relevés dans le processus de création d'une solution innovante de blockchain publique conçue pour une mise à l'échelle:

source: • Full decentralization - Eliminating the need for any trusted third party, hence removing any single point of failure;
fr: • Décentralisation complète - Élimination du besoin de tout tiers de confiance, supprimant ainsi tout point de défaillance unique;

source: • Robust security - Allowing secure transactions and preventing any attacks based on known attack vectors;
fr: Sécurité robuste – Permettant des transactions sécurisées et empêchant toute attaque basée sur des vecteurs connus;

source: • High scalability - Enabling the network to achieve a performance at least equal to the centralized counterpart, as measured in TPS;
fr: Haute scalabilité - Permettre au réseau d'atteindre une performance en transactions par seconde (TPS) au moins égale à son homologue centralisé;

source: • Efficiency - Performing all network services with mini- mal energy and computational requirements;
fr: Efficacité - Exécution de tous les services réseau avec des exigences énergétiques et informatiques minimales;

source: • Bootstrapping and storage enhancement - Ensuring a competitive cost for data storage and synchronization;
fr: • Amorçage et amélioration du stockage - Assurant un coût compétitif pour le stockage et la synchronisation des données;

source: • Cross-chain interoperability - Enforced by design, per- mitting unlimited communication with external services. Starting from the above challenges, we’ve created Elrond as a complete rethinking of public blockchain infrastructure, specifically designed to be secure, efficient, scalable and inter-operable. Elrond’s main contribution rests on two cornerstone building blocks:
fr: • Interopérabilité entre chaînes - renforcée nativement à la conception, permettant une communication illimitée avec les services externes. À partir des défis ci-dessus, nous avons créé Elrond en repensant complètement l'infrastructure de Blockchain publique, spécialement conçue pour être sécurisée, efficace et interopérable. La principale contribution d'Elrond repose sur 2 piliers fondamentaux de construction:

source: 1) A genuine State Sharding approach: effectively partitioning the blockchain and account state into multiple shards, handled in parallel by different participating validators;
fr: 1) Un véritable mécanisme de partitionnement horizontal d'états (State Sharding) : partitionner efficacement la Blockchain et l'état des comptes en plusieurs fragments, gérés en parallèle par différents validateurs participants;

source: 2) Secure Proof of Stake consensus mechanism: an improved variation of Proof of Stake (PoS) that ensures long term security and distributed fairness, while eliminating the need for energy intensive PoW algorithms.
fr: 2) Un mécanisme de consensus sécurisé à preuve d'enjeu : une variante améliorée de la preuve d'enjeu (PoS) qui garantit la sécurité à long terme et l'équité distribuée, tout en éliminant le besoin d'algorithmes PoW énergivores.

source: 3 Adaptive State Sharding
fr: 3 Partitionnement d'état adaptatif

source: Elrond proposes a dynamically adaptive sharding mechanism that enables shard computation and reorganizing based on necessity and the number of active network nodes. The reassignment of nodes in the shards at the beginning of each epoch is progressive and nondeterministic, inducing no temporary liveness penalties. Adaptive state sharding comes with additional challenges compared to the static model. One of the key-points resides in how shard-splitting and shard- merging is done to prevent overall latency penalties introduced by the synchronization/communication needs when the shard number changes. Latency, in this case, is the communication overhead required by nodes, in order to retrieve the new state, once their shard address space assignment has been modified.
fr: Elrond propose un mécanisme de partage adaptatif dynamique qui permet le calcul et la réorganisation des fragments en fonction du besoin et du nombre de nœuds réseau actifs. La réaffectation des nœuds dans les fragments au début de chaque époque est progressive et non déterministe, n'induisant aucune pénalité temporaire sur la note de performance. Le partage d'état adaptatif s'accompagne de défis supplémentaires par rapport au modèle statique. L'un des points clés réside dans la façon dont le partitionnement et la fusion des fragments sont effectués pour éviter les pénalités de latence globales introduites par les besoins de synchronisation / communication lorsque le nombre de fragments change. La latence, dans ce cas, est la surcharge de communication requise par les nœuds, afin de récupérer le nouvel état, une fois que leur affectation d'espace d'adressage de fragment a été modifiée.

source: Elrond proposes a solution for this problem below, but first some notions have to be defined: users and nodes. Users are external actors and can be identified by an unique account address; nodes are computers/devices in the Elrond network that run our protocol. Notions like users, nodes, addresses will be further described in chapter II.1 - Entities.
fr: Elrond propose une solution au problème ci-dessous, mais d'abord quelques notions doivent être définies : utilisateurs et nœuds. Les utilisateurs sont des acteurs externes et peuvent être identifiés par une adresse de compte unique ; les nœuds sont des ordinateurs/appareils du réseau Elrond qui exécutent notre protocole. Des notions telles que les utilisateurs, les nœuds et les adresses seront décrites plus en détail dans le chapitre II.1 - Entités.

source: Elrond solves this challenge by:
fr: Elrond résout ce défi en :

source: 1) Dividing the account address space in shards, using a binary tree which can be built with the sole requirement of knowing the exact number of shards in a certain epoch. Using this method, the accumulated latency is reduced and the network liveness is improved in two ways. First, thanks to the designed model, the dividing of the account address space is predetermined by hierarchy. Hence, there is no split overhead, meaning that one shard breaks into two shards, each of them keeping only one half of the previous address space in addition to the associated state. Second, the latency is reduced through the state redundancy mechanism, as the merge is prepared by retaining the state in the sibling nodes.
fr: 1) Divisant l'espace d'adressage des comptes dans les fragments, en utilisant un arbre binaire qui peut être construit avec la seule exigence de connaissance exact du nombre de fragments à une époque donnée. Cette méthode permet de réduire la latence accumulée et d'améliorer l'efficacité du réseau de deux manières. Premièrement, grâce au modèle conçu, la division de l'espace d'adressage des comptes est prédéterminée par la hiérarchie. Ainsi, il n'y a pas de surcharge de division, ce qui signifie qu'un fragment se divise en deux. Chacun d'eux ne conservant que la moitié de l'espace d'adressage précédent en plus de l'état associé. Ensuite, la latence est réduite grâce au mécanisme de redondance d'état, car la fusion est préparée en conservant l'état dans les nœuds de meme parent.

source: 2) Introducing a technique of balancing the nodes in each shard, to achieve overall architecture equilibrium. This technique ensures a balanced workload and reward for each node in the network.
fr: 2) Introduisant une technique d'équilibrage des nœuds dans chaque fragment, afin d'obtenir un équilibre global de l'architecture. Cette technique assure une charge de travail équilibrée et une récompense pour chaque nœud du réseau.

source: 3) Designing a built-in mechanism for automatic transac- tion routing in the corresponding shards, considerably reduces latency as a result. The routing algorithm is described in chapter IV.4 - Elrond sharding approach.
fr: 3) Concevant un mécanisme intégré pour l'acheminement automatique des transactions dans les fragments correspondants, ce qui réduit considérablement la latence. L'algorithme de routage est décrit au chapitre IV.4 - Approche des Shards d'Elrond.

source: 4) In order to achieve considerable improvements with re- spect to bootstrapping and storage, Elrond makes use of a shard pruning mechanism. This ensures sustainability of our architecture even with a throughput of tens of thousands of transactions per second (TPS).
fr: 4) Afin d'obtenir des améliorations considérables tout en ne pénalisant pas l'initialisation au démarrage et le stockage, Elrond utilise un mécanisme d'élagage des fragments. Cela assure la durabilité de notre architecture, même avec un débit de dizaines de milliers de transactions par seconde (TPS).

source: 4 Secure Proof of Stake (SPoS)
fr: 4 Preuve d'enjeu sécurisée (SPoS ou Secure Proof of Stake)

source: We introduce a Secure Proof of Stake consensus mecha- nism, that expands on Algorand’s [3] idea of a random se- lection mechanism, differentiating itself through the following aspects:
fr: Nous introduisons un mécanisme de consensus "Preuve sûre de l'enjeu", qui développe l'idée d'Algorand [3] d'un mécanisme de sélection aléatoire, en se différenciant par les aspects suivants :

source: 1) Elrond introduces an improvement which reduces the latency allowing each node in the shard to determine the members of the consensus group (block proposer and validators) at the beginning of a round. This is possible because the randomization factor r is stored in every block and is created by the block proposer using a BLS signature [4] on the previous r.
fr: 1) Elrond introduit une amélioration qui réduit la latence en permettant à chaque nœud des fragments de déterminer les membres du groupe de consensus (proposants de bloc et valideurs) au début d'un tour. Cela est possible parce que le facteur de randomisation r est stocké dans chaque bloc et est créé par le proposant de bloc en utilisant une signature BLS [4] sur le r précédent.

source: 2) The block proposer is the validator in the consensus group who’s hash of the public key and randomization factor is the smallest. In contrast to Algorand’s [3] approach, where the random committee selection can take up to 12 seconds, in Elrond the time necessary for random selection of the consensus group is considerably reduced (estimated under 100 ms) excluding network latency. Indeed, there is no communication requirement for this random selection process, which enables Elrond to have a newly and randomly selected group that succeeds in committing a new block to the ledger in each round.
fr: 2) Le proposant du bloc est le valideur dans le groupe de consensus dont le hachage de la clé publique et du facteur de randomisation est le plus petit. Contrairement à l'approche d'Algorand [3], où la sélection du comité aléatoire peut prendre jusqu'à 12 secondes, avec Elrond, le temps nécessaire à la sélection aléatoire du groupe de consensus est considérablement réduit (estimé à moins de 100 ms), hors latence du réseau. En effet, il n'y a pas d'exigence de communication pour ce processus de sélection aléatoire, ce qui permet à Elrond d'avoir un groupe nouvellement et aléatoirement sélectionné qui réussit à engager un nouveau bloc dans le registre à chaque tour.

source: The tradeoff for this enhancement relies on the premise that an adversary cannot adapt faster than the round’s time frame and can choose not to propose the block. A further improvement on the security of the randomness source, would be the use of verifiable delay functions (VDFs) in order to prevent any tampering possibilities of the randomness source until it is too late. Currently, the research in VDFs is still ongoing- there only a few working (and poorly tested) VDF implementations.
fr: Le compromis pour cette amélioration repose sur le principe qu'un adversaire ne peut pas s'adapter plus vite que le calendrier du cycle et peut choisir de ne pas proposer le bloc. Une autre amélioration de la sécurité de la source d'aléa serait l'utilisation de fonctions de retard vérifiables (VDF) afin d'empêcher toute possibilité de falsification de la source d'aléa jusqu'à ce qu'il soit trop tard. Actuellement, la recherche sur les VDF est toujours en cours - il n'existe que quelques implémentations VDF fonctionnelles (et mal testées).

source: 3) In addition to the stake factor generally used in PoS architectures as a sole decision input, Elrond refines its consensus mechanism by adding an additional weight factor called rating. The node’s probability to be selected in the consensus group takes into consideration both stake and rating. The rating of a block proposer is recal- culated at the end of each epoch, except in cases where slashing should occur, when the actual rating decrease is done instantly, adding another layer of security by promoting meritocracy.
fr: 3) En plus du facteur de mise en jeu généralement utilisé dans les architectures de PoS comme seul élément de décision, Elrond affine son mécanisme de consensus en ajoutant un facteur de pondération supplémentaire appelé notation. La probabilité que le nœud soit sélectionné dans le groupe de consensus prend en considération à la fois l'enjeu et la notation. La notation d'un proposant de bloc est recalculée à la fin de chaque époque, sauf dans les cas où des coupes devraient se produire, où la diminution réelle de la notation est faite instantanément, ajoutant une autre couche de sécurité en promouvant la méritocratie.

source: 4) A modified BLS multisignature scheme [5] with 2 communication rounds is used by the consensus group for block signing
fr: 4) Un système modifié de signature multiple du BLS [5] avec 2 cycles de communication est utilisé par le groupe de consensus pour la signature en bloc

source: 5) Elrond considers formal verification for the critical pro- tocol implementations (e.g. SPoS consensus mechanism) in order to validate the correctness of our algorithms.
fr: 5) Elrond envisage une vérification formelle pour les implémentations critiques du protocole (par exemple, le mécanisme de consensus SPoS) afin de valider la justesse de nos algorithmes.

source: II Architecture Overview
fr: II Aperçu de l'architecture

source: 1 Entities
fr: 1 Entités

source: There are two main entities in Elrond: users and nodes. Users, each holding a (finite) number of public / private (Pk/sk) key pairs (e.g. in one or multiple wallet apps), use the Elrond network to deploy signed transactions for value transfers or smart contracts’ execution. They can be identified by one of their account addresses (derived from the public key). The nodes are represented by the devices that form the Elrond network and can be passive or actively engaged in processing tasks. Eligible validators are active participants in Elrond’s network. Specifically, they are responsible for running consensus, adding blocks, maintaining the state and being rewarded for their contribution. Each eligible validator can be uniquely identified by a public key constructed through a derivation of the address that staked the necessary amount and the node id. Relations between entities in the Elrond protocol are shown in Fig. 1.
fr: Il y a deux entités principales dans Elrond : les utilisateurs et les nœuds. Les utilisateurs détiennent tous un nombre (fini) de (Pk/sk) (par exemple dans une ou plusieurs applications de portefeuille). Ils utilisent le réseau Elrond pour déployer des transactions signées, afin de transférer de la valeur, ou pour exécuter des Smarts Contracts. Les utilisateurs sont identifiés par l'une de leurs adresses de compte (dérivées de la clé publique). Les nœuds sont représentés par les terminaux dont est constitué le réseau Elrond, et peuvent être engagés passivement ou activement dans le traitement des tâches. Les validateurs éligibles sont des participants actifs dans le réseau Elrond. Plus précisément, ils sont chargés de l’application du consensus, de l'ajout de blocs, du maintien du statut, en échange de quoi, ils perçoivent des récompenses. Chaque validateur éligible est identifié de manière unique par une clé publique dérivée à la fois de l'adresse où est déposé le collatéral, et aussi de l'identifiant du nœud.

source: Fig. 1: Relations between Elrond entities
fr: Fig. 1 : Relations entre les entités Elrond

source: Furthermore, the network is divided into smaller units called shards. An eligible validator is assigned to a shard based on an algorithm that keeps the nodes evenly distributed across shards, depending on the tree level. Each shard contains a randomly selected consensus group. Any block proposer is responsible to aggregate transactions into a new block. The validators are responsible to either reject, or approve the proposed block, thereby validating it and committing it to the blockchain.
fr: De plus, le réseau est divisé en unités plus petites appelées fragments. Un valideur éligible est attribué à un fragmentsur la base d'un algorithme qui maintient les nœuds uniformément répartis à travers les fragment, en fonction du niveau dans l'arbre. Chaque shard contient un groupe de consensus choisi au hasard. Quiconque propose un bloc est responsable de l'agrégation des transactions dans un nouveau bloc. Les validateurs sont chargés soit de rejeter, soit d'approuver le bloc proposé, de sorte à le valider et à l’inscrire définitivement dans la blockchain.

source: 2 Intrinsic token
fr: 2 Jeton intrinsèque

source: Elrond grants access to the usage of its network through intrinsic utility tokens called Elronds, in short ERDs. All costs for processing transactions, running smart contracts and rewards for various contributions to the network will be paid in ERDs. References to fees, payments or balances are assumed to be in ERDs.
fr: La façon dont Elrond autorise l'accès pour l’utilisation de son réseau se fait par le biais de jetons d’utilité intrinsèque appelés Elronds, en abrégé ERD. Tous les coûts liés au traitement des transactions, à l'exécution des « smart contracts » et aux récompenses pour les diverses contributions au réseau seront payés en ERD. Les références aux frais, aux paiements ou aux soldes sont supposées être en ERD.

source: 3 Threat model
fr: 3. Modèle de menace
