Repository: stratej-fr/erlond-doc-fr
Catalog: xliff_erlond-white-paper_elrond-whitepaperdocx_*.xlf
Languages: fr

source: Smart contracts on sharded architectures are still in the early stages of research and development and pose serious challenges. Protocols like Atomix [7] or S-BAC [9] represent a starting point. Dynamic smart contract dependencies cannot be resolved by moving the SCs into the same shard, as at deployment time, not all the dependencies can be calculated.
fr: Les Smart Contracts sur les architectures en Shards n'en sont encore qu'à leurs débuts et posent de sérieux problèmes. Des protocoles comme Atomix [7] ou S-BAC [9] représentent un point de départ. Les dépendances des Smart Contracts dynamiques ne peuvent pas être résolues en déplaçant les Smart Contracts dans le même Shard, car au moment du déploiement, toutes les dépendances ne peuvent pas être calculées.

source: Solution currently research in the space:
fr: Solution en cours de recherche dans ce champ :

source: 1) A locking mechanism that allows the atomic execution of smart contract from different shards, ensures that the involved SCs will be either all executed at the same time, or none at all. This requires multiple interaction messages and synchronization between consensuses of different shards. [9]
fr: 1) Un mécanisme de verrouillage qui permet l'exécution atomique de Smart Contracts à partir de différents Shards, garantit que les Smart Contracts concernés seront, ou bien tous exécutés en même temps, ou alors aucun d'entre eux. Cela nécessite de multiples messages d'interaction et une synchronisation entre les consensus des différents Shards. [9]

source: 2) Cross-shard contract yanking proposal for Ethereum 2.0 would move that smart contract code and data into the caller shard at the execution time. Atomic execution is not needed, but the locking mechanism is mandatory on the moved SC, which would block the execution of SC for other transactions. The locking mechanism is simpler, but it needs to transfer the whole internal state of the SC. [43]
fr: 2) La proposition de transfert de contrats inter Shards pour Ethereum 2.0 permettrait de transférer le code et les données de ce Smart Contract dans le Shard de l'appelant au moment de l'exécution. L'exécution atomique n'est pas nécessaire, mais le mécanisme de verrouillage est obligatoire sur le Smart Contract déplacé, ce qui bloquerait l'exécution du Smart Contract pour d'autres transactions. Le mécanisme de verrouillage est plus simple, mais il doit transférer l'ensemble de l'état interne du SC. [43]

source: Following Ethereum’s model, Elrond has the following transaction types:
fr: Suivant le modèle d'Ethereum, Elrond présente les types de transaction suivants :

source: 1) SC construction and deployment: transactions receiver address is empty and data field contains the smart contract code as byte array;
fr: 1) Construction et déploiement de Smart Contract: l'adresse du destinataire des transactions est vide et le champ de données contient le code du Smart Contract sous forme de tableau d'octets ;

source: 2) SC method invoking: transaction has a non empty re- ceiver address and that address has an associated code;
fr: 2) Méthode d'invocation du Smart Contract : la transaction contient une adresse de destinataire non vide et cette adresse dispose d'un code associé ;

source: 3) Payment transactions: transaction has a non empty re- ceiver and that address does not have code.
fr: 3) Transactions de paiement : la transaction contient un destinataire non vide et cette adresse ne dispose pas de code associé.

source: Elrond’s approach to this problem is to use asynchronous cross-shard execution model in case of smart contracts. The user creates a smart contract execution transaction. If the smart contract is not in the current shard, the transaction is treated as a payment transaction, the value of the transaction is subtracted from the sender account and it is added to the block where the sender shard resides, into a miniblock with the destination shard where the receiver account is. The transaction is notarized by metachain, then processed by the destination shard. In the destination shard, the transaction is treated as SC method invoking, as the receiver address is a smart contract which exists in this shard. For the smart contract call a temporary account which shadows the sender account is created, with the balance from the transaction value and the smart contract is called. After the execution, the smart contract might return results which affects a number of accounts from different shards.
fr: L'approche d'Elrond à ce problème est d'utiliser le modèle d'exécution asynchrone des inter Shards pour le cas de Smart Contracts. L'utilisateur crée une transaction d'exécution de Smart Contract. Si le Smart Contract n'est pas dans le Shard courant, la transaction est traitée comme une opération de paiement, la valeur de la transaction est soustraite du compte émetteur et elle est ajoutée au bloc où réside le Shard émetteur, dans un minibloc avec le Shard de destination où se trouve le compte récepteur. La transaction est notariée par la métachaîne, puis traitée par le Shard de destination. Dans le Shard de destination, la transaction est traitée comme une méthode d'invocation de Smart Contract, car l'adresse du destinataire est un Smart Contract qui existe dans ce tesson. Pour l'appel de Smart Contract, un compte temporaire est créé, en tant qu'image du compte de l'expéditeur, avec le solde de la valeur de la transaction puis le Smart Contract est appelé. Après l'exécution, le Smart Contract peut renvoyer des résultats qui affectent un certain nombre de comptes de différents Shards.

source: All the results, which affect in-shard accounts are executed in the same round. For those accounts which are not in the shard where the smart contract was executed, transactions called Smart Contract Results will be created, saving the smart contract execution output for each of these accounts. SCR miniblocks are created for each destination shard. These miniblocks are notarized the same way as cross-shard transactions by metachain, then processed by the respective shards, where the accounts resides. In case one smart contract calls dynamically another smart contract from another shard, this call is saved as an intermediate result and treated the same as for accounts.
fr: Tous les résultats, qui affectent des comptes à l'intérieur d'un même Shard, sont exécutés au cours du même tour. Pour les comptes qui ne sont pas dans le Shard où le Smart Contract a été exécuté, des transactions appelées "Smart Contract Resultats" seront créées, sauvegardant le résultat de l'exécution du Smart Contract pour chacun de ces comptes. Des miniblocs SCR sont créés pour chaque Shards de destination. Ces miniblocs sont notariés de la même manière que les transactions entre Shards par métachaîne, puis traités par les Shards respectifs, où se trouvent les comptes. Si un Smart Contract appelle dynamiquement un autre Smart Contract à partir d'un autre Shard, cet appel est enregistré comme résultat intermédiaire et traité de la même manière que pour les comptes.

source: The solution has multiple steps and the finalization of a cross-shard smart contract call will need at least 5 rounds, but it does not need locking and state movement across shards.
fr: La solution se déroule en plusieurs étapes et la finalisation d'un appel de Smart Contract entre Shards nécessitera au moins 5 tours, mais elle ne requiert pas de verrouillage ni de propagation d'état à travers les Shards.

source: IX Bootstrapping and Storage
fr: IX Amorçage et stockage

source: 1 Timeline division
fr: 1 Division du calendrier

source: Proof of Stake systems tend to generally divide timeline into epochs and each epoch into smaller rounds [19]. The timeline and terminology may differ between architectures but most of them use a similar approach.
fr: Les systèmes à preuve d'enjeu ont tendance à diviser la chronologie en époques et chaque époque en tours plus petits [19]. La chronologie et la terminologie peuvent varier d'une architecture à l'autre, mais la plupart d'entre elles utilisent une approche similaire.

source: Epochs
fr: Les époques

source: 3In Elrond Protocol, each epoch has a fixed duration, initially set to 24 hours (might suffer updates after several testnet con- firmation stages). During this timeframe, the configuration of the shards remains unchanged. The system adapts to scalability demands between epochs by modifying the number of shards. To prevent collusion, after an epoch, the configuration of each shard needs to change. While reshuffling all nodes between shards would provide the highest security level, it would affect the system’s liveness by introducing additional latency due to bootstrapping. For this reason, at the end of each epoch, less than 1 of the eligible validators, belonging to a shard will be redistributed non-deterministically and uniformly to the other shards’ waiting lists.
fr: 3 Dans le protocole Elrond, chaque époque a une durée fixe, initialement fixée à 24 heures (valeur susceptible d'évoluer après quelques étape de confirmation du testnet). Pendant cette période, la configuration des Shards reste inchangée. Le système s'adapte aux exigences de scalabilité entre les époques en modifiant le nombre de Shards. Pour éviter toute collusion, après une époque, la configuration de chaque Shards doit être modifiée. Un remaniement de tous les nœuds entre les Shards permettrait d'obtenir le niveau de sécurité le plus élevé, mais il affecterait la viabilité du système en introduisant une latence supplémentaire due à l'amorçage. C'est pourquoi, à la fin de chaque époque, moins d'un des validateurs éligibles appartenant à un Shard sera redistribué de manière non déterministe et uniforme sur les listes d'attente des autres Shards.

source: Only prior to the start of a new epoch, the validator distribution to shards can be determined, without additional communication as displayed in Fig. 10.
fr: Ce n'est qu'avant le début d'une nouvelle époque que la distribution des validateurs aux Shards peut être déterminée, sans communication supplémentaire, comme le montre la figure 10.

source: The node shuffling process runs in multiple steps:
fr: Le processus de remaniement des nœuds se déroule en plusieurs étapes :

source: 1) The new nodes registered in the current epoch ei land in the unassigned node pool until the end of the current epoch;
fr: 1) Les nouveaux nœuds enregistrés à l'époque courante ei atterrissent dans le pool de nœuds non attribués jusqu'à la fin de l'époque actuelle ;

source: 6) The reshuffled nodes from the assigned node pool are redistributed with higher ratios to shards’ waiting lists that will need to split in the next epoch ei+2.
fr: 6) Les nœuds remaniés du pool de nœuds attribués sont redistribués avec des ratios plus élevés aux listes d'attente des Shards qui devront se séparer à la prochaine époque ei+2.

source: Rounds
fr: Tours

source: Each round has a fixed time duration of 5 seconds (might suffer updates after several testnet confirmation stages). During each round, a new block can be produced within every shard by a randomly selected set of block validators (including one block proposer). From one round to another the set is changed using the eligible nodes list, as detailed in the chapter IV.
fr: Chaque tour a une durée fixe de 5 secondes (peut subir des mises à jour après plusieurs étapes de confirmation testnet). Lors de chaque tour, un nouveau bloc peut être produit dans chaque partition par un ensemble de validateurs de blocs sélectionnés au hasard (y compris un proposant de blocs). D'un tour à l'autre, l'ensemble est modifié à l'aide de la liste des nœuds éligibles, comme indiqué dans le chapitre IV.

source: As described before, the reconfiguration of shards within epochs and the arbitrary selection of validators within rounds discourages the creation of unfair coalitions, diminishes the possibility of DDoS and bribery attacks while maintaining decentralization and a high transactions throughput.
fr: Comme décrit précédemment, la reconfiguration des Shards au sein des époques et la sélection arbitraire des validateurs au sein des cycles découragent la création de coalitions injustes, diminuent la possibilité de DDoS et d'attaques de corruption tout en maintenant la décentralisation et un débit de transactions élevé.

source: 2 Pruning
fr: 2 Élagage

source: A high throughput will lead to a distributed ledger that rapidly grows in size and increases bootstrapping cost (time+storage), as highlighted in section XI.1.
fr: Un débit élevé conduira à un registre distribué qui croîtra rapidement en taille et augmentera le coût d'amorçage (temps+stockage), comme souligné dans la section XI.1.

source: This cost can be addressed by using efficient pruning algorithms, that can summarize the blockchain’s full state in a more condensed structure. The pruning mechanism is similar to the stable checkpoints in pBFT [15] and compresses the entire ledger state.
fr: Ce coût peut être compensé par l'utilisation d'algorithmes d'élagage efficaces, qui peuvent résumer l'état complet de la BlockChain dans une structure plus condensée. Le mécanisme d'élagage est similaire aux points de contrôle stables de la pBFT [15] et compresse l'ensemble de l'état du livre..

source: Elrond protocol makes use of an efficient pruning algorithm [7] detailed below. Let us consider that e is the current epoch and a is the current shard:
fr: Le protocole Elrond utilise un algorithme d'élagage performant [7] détaillé ci-dessous. Considérons que e est l'époque actuelle et que a est le Shard actuel :

source: 1) the shard nodes keep track of the account balances of e in a Merkle tree [44];
fr: 1) les nœuds de shards gardent une trace des soldes des comptes de e dans un arbre Merkle [44] ;

source: 2) at the end of each epoch, the block proposer creates a state block sb(a, e), which stores the hash of the Merkle tree’s root in the block’s header and the balances in the block’s body;
fr: 2) à la fin de chaque époque, le proposant de bloc crée un bloc d'état sb(a, e), qui stocke le hachage de la racine de l'arbre Merkle dans l'en-tête du bloc et les soldes dans le corps du bloc ;

source: 3) validators verify and run consensus on sb(a, e);
fr: 3) les validateurs vérifient et exécutent le consensus sur sb(a, e) ;

source: 4) if consensus is reached, the block proposer will store sb(a, e) in the shard’s ledger, making it the genesis block for epoch e + 1;
fr: 4) si un consensus est atteint, le proposant du bloc stockera sb(a, e) dans le registre du Shard, ce qui en fera le bloc de genèse pour l'époque e + 1 ;

source: 5) at the end of epoch e + 1, nodes will drop the body of sb(a, e) and all blocks preceding sb(a, e).
fr: 5) à la fin de l'époque e + 1, les nœuds feront tomber le corps de sb(a, e) et tous les blocs précédant sb(a, e).

source: Using this mechanism, the bootstrapping of the new nodes should be very efficient. Actually, they start only from the last valid state block and compute only the following blocks instead of its full history.
fr: Grâce à ce mécanisme, l'amorçage des nouveaux nœuds devrait être très performant. En fait, ils ne partent que du dernier bloc d'état valide et ne calculent que les blocs suivants au lieu de son historique complet.

source: 32) Less than 1 of the nodes in every shard are randomly selected to be reshuffled and are added to the assigned node pool;
fr: 2) Moins d'un tier (1/3) des nœuds de chaque shard sont sélectionnés aléatoirement pour être remaniés et ajoutés au pool de nœuds attribué ;

source: 3) The new number of shards Nsh,i+1 is computed based on the number of nodes in the network ki and network usage;
fr: Le nouveau nombre de Shards Nsh,i+1 est calculé sur la base du nombre de nœuds dans le réseau ki et de l'utilisation du réseau ;

source: 4) Nodes previously in all shard’s waiting lists, that are cur- rently synchronized, are added to the eligible validator’s lists;
fr: Les nœuds précédemment présents dans toutes les listes d'attente de Shards, qui sont actuellement synchronisés, sont ajoutés aux listes des validateurs éligibles ;

source: 5) The newly added nodes from the unassigned node pool are uniformly random distributed across all shards’ waiting lists during epoch ei+1;
fr: Les nouveaux nœuds ajoutés à partir du pool de nœuds non attribués sont uniformément répartis de manière aléatoire sur toutes les listes d'attente des Shards pendant l'époque ei+1 ;

source: X Security Evaluation
fr: X Évaluation de la sécurité

source: 1 Randomness source
fr: 1 Source à caractère aléatoire

source: Elrond makes use of random numbers in its operation e.g. for the random sampling of block proposer and validators into consensus groups and the shuffling of nodes between shards at the end of an epoch. Because these features contribute to Elrond’s security guarantees, it is therefore important to make use of random numbers that are provably unbiasable and unpredictable. In addition to these properties, the generation of random numbers also needs to be efficient so that it can be used in a scalable and high throughput blockchain architecture. These properties can be found in some asymmetric cryptog- raphy schemes, like the BLS signing scheme. One important property of BLS is that using the same private key to sign the same message always produces the same results. This is similar to what is achieved using ECDSA with
fr: Elrond utilise des nombres aléatoires dans son fonctionnement, par exemple pour l'échantillonnage aléatoire des proposants de blocs et des validateurs des groupes de consensus et le mélange des nœuds entre les Shards à la fin d'une époque. Étant donné que ces caractéristiques contribuent aux garanties de sécurité d'Elrond, il est donc important d'utiliser des nombres aléatoires qui sont manifestement imbiaisables et imprévisibles. En plus de ces propriétés, la génération de nombres aléatoires doit également être efficace afin qu'elle puisse être utilisée dans une architecture Blockchain évolutive et à haut débit. Ces propriétés peuvent être trouvées dans certains schémas cryptographiques asymétriques, comme le schéma de signature BLS. Une propriété importante de BLS est que l'utilisation de la même clé privée pour signer le même message produit toujours les mêmes résultats. Ce résultat est similaire à celui obtenu avec l'ECDSA et sa génération déterministe k et il est dû au fait que le système n'utilise aucun paramètre aléatoire :

source: deterministic k generation and is due to the scheme not using any random parameters:
fr: [ABOVE]

source: where H is a hashing function that hashes to points on the used curve and sk is the private key.
fr: où H est une fonction de hashage qui hashe en points sur la courbe utilisée et sk est la clé privée.

source: 2 Randomness creation in Elrond
fr: 2 Création à caractère aléatoire pour Elrond

source: One random number is created in every round, and added by the block proposer to every block in the blockchain. This ensures that the random numbers are unpredictable, as each random number is the signature of a different block proposer over the previous randomness source. The creation of random numbers is detailed below as part of one consensus round:
fr: Un nombre aléatoire est créé dans chaque tour, et ajouté par le promoteur de bloc à chaque bloc de la Blockchain. Cela garantit que les nombres aléatoires sont imprévisibles, car chaque nombre aléatoire est la signature d'un promoteur de bloc différent par rapport à la source aléatoire précédente. La création de nombres aléatoires est décrite ci-dessous dans le cadre d'un cycle de consensus :

source: 1) New consensus group is selected using the randomness source from the previous block header. Consensus group is formed by a block proposer and validators.
fr: 1) Le nouveau groupe de consensus est sélectionné à l'aide de la source de caractère aléatoire de l'en-tête de bloc précédent. Le groupe de consensus est formé par un promoteur de bloc et des validateurs.

source: 2) The block proposer signs the previous randomness source with BLS, adds the signature to the proposed block header as new randomness source, then broadcasts this block to the consensus group.
fr: 2) Le proposant du bloc signe la source de caractère aléatoire précédente avec le BLS, ajoute la signature à l'en-tête du bloc proposé comme nouvelle source de caractère aléatoire, puis diffuse ce bloc au groupe de consensus.

source: 3) Each member of the consensus group validates the randomness source as part of block validation, and sends their block signature to the block proposer.
fr: 3) Chaque membre du groupe de consensus valide la source de caractère aléatoire dans le cadre de la validation du bloc, et envoie sa signature de bloc au promoteur de bloc.

source: 4) Block proposer aggregates the validators block signa- tures and broadcasts the block with the aggregated block signature and the new randomness source to the whole shard.
fr: 4) Le proposant de bloc agrège les signatures de bloc des validateurs et diffuse le bloc avec la signature de bloc agrégée et la nouvelle source de caractère aléatoire à l'ensemble de la shard.

source: The evolution of randomness source in each round can be seen as an unbiasable and verifiable blockchain, where each new random number can be linked to and verified against the previous random number.
fr: L'évolution aléatoire de la source dans chaque cycle peut être considérée comme une blockchain non biaisée et vérifiable, où chaque nouveau nombre aléatoire peut être lié et vérifié par rapport au nombre aléatoire précédent.

source: 3 ”K” block finality scheme
fr: 3 Schéma de finalité du bloc "K"

source: 33The signed block at round n is final, if and only if blocks n + 1, n + 2, ..., n + k are signed. Furthermore, a final block cannot be reverted. The metachain notarizes only final blocks to ensure that a fork in one shard does not affect other shards. Shards only take into consideration the final metachain blocks, in order to not be affected if the metachain forks. Finality and correctness is verified at block creation and at block validation as well. The chosen k parameter is 1 and this ensures forks of maximum 2 blocks length. The probability that a malicious super majority (> 2 · n + 1) is selected in the shard for the
fr: Le bloc signé au tour n est définitif, si et seulement si les blocs n + 1, n + 2, ..., n + k sont signés. En outre, un bloc final ne peut pas être annulé. La métachaîne ne notifie que les blocs finaux afin de garantir qu'une bifurcation dans une shard n'affecte pas les autres. Celles-ci ne prennent en considération que les blocs finaux de la métachaîne, afin de ne pas être affectés si elle se ramifie. La finalité et l'exactitude sont vérifiées lors de la création et de la validation des blocs. Le paramètre k choisi est 1, ce qui garantit des fourches d'une longueur maximale de 2 blocs. La probabilité qu'une super majorité malveillante (> 2 - n + 1) soit sélectionnée dans le tesson pour le
