Repository: stratej-fr/erlond-doc-fr
Catalog: xliff_erlond-white-paper_elrond-whitepaperdocx_*.xlf
Languages: fr

source: 1) Reinforcement learning: we aim to increase the efficiency of the sharding process by allocating the frequently trading clients in the same shard to reduce the overall cost;
fr: 1) Renforcement de l'apprentissage : nous visons à accroître l'efficacité du processus de Sharding en répartissant les clients qui négocient fréquemment dans le même Shard afin de réduire le coût global ;

source: 2) AI supervision: create an AI supervisor that detects malicious behavioral patterns; it is still uncertain how this feature can be integrated in the protocol without disrupting the decentralization;
fr: 2) IA pour la supervision : créer un superviseur en IA qui détecte les modèles de comportement malveillant ; on ne sait pas encore comment cette fonctionnalité peut être intégrée dans le protocole sans perturber la décentralisation ;

source: 3) Reliability as a consensus factor: the existing protocol weighs between stake and rating but we plan to add reliability, as a metric that should be computed in a distributed manner after applying a consensus protocol on previously submitted blocks from the very recent
fr: 3) Fiabilité en tant que facteur de consensus : le protocole existant pondère entre l'enjeu (staking) et la notation (rating), mais nous prévoyons d'ajouter la fiabilité, comme une mesure qui devrait être calculée de manière distribuée après l'application d'un protocole de consensus sur les blocs précédemment soumis récemment.

source: Fig. 12: Network throughput measured in transactions per seconds with a global network speed of 8 MB/s
fr: Fig. 12 : Débit réseau mesuré en transactions par seconde avec une vitesse globale sur le réseau de 8 Mo/s

source: history;
fr: l'histoire;

source: 4) Cross-chain interoperability: implements and con- tribute to standards like those initiated by the De- centralized Identity Foundation [53] or the Blockchain Interoperability Alliance [54];
fr: 4) interopérabilité inter-blockchain : mettre en œuvre et rendre hommage à des normes telles que celles lancées par la Decentralized Identity Foundation [53] ou la Blockchain Interoperability Alliance [54] ;

source: 5) Privacy preserving transactions: use Zero-Knowledge Succinct Non-Interactive Argument of Knowledge [55] to protect the identity of the participants and offer auditing capabilities while preserving the privacy.
fr: 5) Transactions préservant la vie privée : utiliser le "Zero-Knowledge Succinct Non-Interactive Argument of Knowledge" [55] pour protéger l'identité des participants et offrir des capacités d'audit tout en préservant la vie privée.

source: 3 Overall Conclusions
fr: 3 Conclusions générales

source: Elrond is the first highly scalable public blockchain that uses the newly proposed Secure Proof of Stake algorithm in a genuine state-sharded architecture to achieve VISA level throughput and confirmation times of seconds. Elrond’s novel approach on adaptive state sharding improves on Om- niledger’s proposal increasing security and throughput, while the built-in automatic transaction routing and state redundancy mechanisms considerably reduce latencies. By using a shard pruning technique the bootstrapping and storage costs are also considerably reduced compared to other approaches. The newly introduced Secure Proof of Stake consensus algorithm ensures distributed fairness and improves on Algorand’s idea of random selection, reducing the time needed for the random selection of the consensus group from 12 seconds to 100 ms. Our method of combining state sharding and the very efficient Secure Proof of Stake consensus algorithm has shown promising results in our initial estimations, validated by our latest testnet results.
fr: Elrond est la première BlockChain publique hautement scalable qui utilise l'algorithme récemment proposé de Preuve d'Enjeu Sécurisée (SPoS) dans une véritable architecture de Sharding d'état pour atteindre un débit équivalent à celui de VISA et des temps de confirmation de quelques secondes. L'approche novatrice d'Elrond sur le Sharding d'états adaptatif améliore la proposition d'Omniledger en augmentant la sécurité et le débit, tandis que le routage automatique des transactions et les mécanismes intégrés de redondance d'états réduisent considérablement les temps de latence. En utilisant une technique de suppression des Shards, les coûts d'amorçage et de stockage sont également considérablement réduits par rapport aux autres approches. L'algorithme de consensus de Preuve d'Enjeu Sécurisée (SPoS) récemment introduit garantit une équité distribuée et améliore l'idée de sélection aléatoire d'Algorand, en réduisant le temps nécessaire pour la sélection aléatoire du groupe de consensus de 12 secondes à 100 ms. Notre méthode de combinaison du Sharding d'états et du très efficace algorithme de consensus de Preuve d'Enjeu Sécurisée (SPoS) a donné des résultats prometteurs dans nos estimations initiales, validées par les derniers résultats de notre testnet.
