Repository: stratej-fr/erlond-doc-fr
Catalog: xliff_erlond-white-paper_elrond-whitepaperdocx_*.xlf
Languages: fr

source: Some sharding proposals attempt to only shard transactions [8] or only shard state [17], which increases transaction’s throughput, either by forcing every node to store lots of state data or to be a supercomputer [2]. Still, more recently, at least one claim has been made about successfully performing both transaction and state sharding, without compromising on storage or processing power [13].
fr: Certaines propositions sharding tentent de mettre en oeuvre uniquement du sharding de transactions [8] ou uniquement du sharding d'état [17], ce qui augmente le débit de la transaction, soit en forçant chaque nœud à stocker beaucoup de données d'état, soit en étant un superordinateur [2]. Pourtant, plus récemment, au moins une revendication a été faite quant à la réussite de sharding à la fois de transaction et d'état, sans compromettre la puissance de stockage ou de traitement [13].

source: But sharding introduces some new challenges like: single- shard takeover attack, cross-shard communication, data availability and the need of an abstraction layer that hides the shards. However, conditional on the fact that the above problems are addressed correctly, state sharding brings considerable overall improvements: transaction throughput will increase significantly due to parallel transaction processing and transaction fees will be considerably reduced. Two main criterias widely considered to be obstacles transforming into advantages and incentives for mainstream adoption of the blockchain technology.
fr: Mais le sharding pose de nouveaux défis, comme l'attaque par prise de contrôle d'un shard unique, la communication entre les shards, la disponibilité des données et la nécessité d'une couche d'abstraction qui cache les shards. Toutefois, sous réserve que les problèmes susmentionnés soient correctement traités, le sharding d’état apporte des améliorations globales considérables : le débit des transactions augmente de manière significative en raison du traitement parallèle des transactions et les frais de transaction seront considérablement réduits. Deux principaux critères largement considérés comme des obstacles se transformant en autant d’avantages et d’incitations à l'adoption généralisée de la technologie blockchain.

source: 4 Elrond sharding approach
fr: 4 Approche d'Elrond sur le sharding

source: While dealing with the complexity of combining network, transaction and state sharding, Elrond’s approach was designed with the following goals in mind:
fr: Tout en faisant face à la complexité de la combinaison du sharding de transaction avec le sharding d’état, l'approche d'Elrond a été conçue avec les objectifs suivants en tête :

source: 1) Scalability without affecting availability: Increasing or decreasing the number of shards should affect a negligibly small vicinity of nodes without causing down- times, or minimizing them while updating states;
fr: 1) Scalabilité sans affecter la disponibilité : Augmenter ou diminuer le nombre de partitions devrait affecter de manière négligeable un petit nombre des nœuds qui sont à proximité, sans provoquer de temps d'arrêt, ou de les minimiser tout en actualisant les états ;

source: 2) Dispatching and instant traceability: Finding out the destination shard of a transaction should be deterministic, trivial to calculate, eliminating the need for communication rounds;
fr: 2) Expédition et traçabilité instantanée : La découverte du shard de destination d'une transaction doit être déterministe, triviale à calculer, éliminant le besoin de tours de communication ;

source: 3) Efficiency and adaptability: The shards should be as balanced as possible at any given time.
fr: 3) Efficacité et adaptabilité : Les partitions doivent être aussi équilibrées que possible à chaque instant.

source: Method Description
fr: Description de la méthode

source: To calculate an optimum number of shards Nsh in epoch ei+1 (Nsh,i+1), we have defined one threshold coefficient for the number of transactions in a block, θT X . Variable optN represents the optimal number of nodes in a shard, sh is a positive number and represents the number of nodes a shard can vary by. totalNi is the total number of nodes (eligible validators, nodes in the waiting lists and newly added nodes in the node pool) on all shards in epoch ei, while NT XB,i is the average number of transactions in a block on all shards in epoch ei. Nsh,0 will be considered as 1.
fr: Pour calculer un nombre optimal de shards Nsh dans l'époque ei+1 (Nsh;i+1), nous avons défini un coefficient de seuil pour le nombre de transactions dans un bloc, TX. La variable optN représente le nombre optimal de nœuds dans un shard, sh est un nombre positif et représente la fourchette de variation du nombre de nœuds d'un shard. totalNi est le nombre total de nœuds (validateurs éligibles, nœuds dans les listes d'attente et nouveaux nœuds dans le pool de nœuds) sur toutes les shards de l'époque ei, tandis que NTXB;i est le nombre moyen de transactions dans un bloc sur tous les shards de l'époque ei. Nsh;0 sera considéré comme valant 1.

source: The total number of shards Nsh,i+1 will change if the number of nodes totalNi in the network changes and if the blockchain utilization needs it: if the number of nodes increases above a threshold nSplit from one epoch to another and the average number of transactions per block is greater than the threshold subset of all nodes should be number of transactions per block NT XB,i > θT X or if the number of nodes decreases below a threshold nMerge as shown in function ComputeShardsN.
fr: Le nombre total de shards Nsh;i+1 changera si le nombre de nœuds totalNi du réseau change et si l’utilisation de la blockchain en a besoin : si le nombre de nœuds augmente au-delà d'un seuil nSplit d'une époque à l'autre et que le nombre moyen de transactions par bloc est supérieur au seuil de transactions par bloc NTXB;i > TX ou si le le nombre de nœuds diminue en dessous d'un seuil nMerge comme indiqué dans la fonction ComputeShardsN.

source: From one epoch to another, there is a probability that the
fr: D'une époque à l'autre, il y a une probabilité que le

source: number of active nodes changes. If this aspect influences the number of shards, anyone can calculate the two masks m1 and m2, used in transaction dispatching.
fr: nombre de shards actifs change. Si cet aspect influence le nombre de shards, n'importe qui peut calculer les deux masques m1 et m2, utilisés dans la distribution des transactions.

source: As the main goal is to increase the throughput beyond thousands of transactions per second and to diminish the cross- shard communication, Elrond proposes a dispatching mechanism which determines automatically the shards involved in the current transaction and routes the transaction accordingly. The dispatcher will take into consideration the account address (addr) of the transaction sender/receiver. The result is the number of the shard (shard) the transaction will be dispatched to.
fr: L'objectif principal étant d'augmenter le débit au-delà des milliers de transactions par seconde et de diminuer la communication entre les shards, Elrond propose un mécanisme de répartition qui détermine automatiquement les partitions impliqués dans la transaction en cours et achemine la transaction en conséquence. L'expéditeur prendra en considération l'adresse de compte (addr) de l'expéditeur/récepteur de la transaction. Le résultat est le numéro de shard (shard) auquel la transaction sera envoyée.

source: The entire sharding scheme is based on a binary tree structure that distributes the account addresses, favors the scalability and deals with the state transitions. A representation of the tree can be seen in Fig. 2.
fr: L'ensemble du système de sharding est basé sur un arbre binaire qui distribue les adresses des comptes, favorise la scalabilité et traite les transitions d'état. Une représentation de l'arbre est visible sur la figure 2.

source: The presented tree structure is merely a logical representation of the account address space used for a deterministic mapping; e.g. shard allocation, sibling computation etc. The leaves of the binary tree represent the shards with their ID number. Starting from root (node/shard 0), if there is only one shard/leaf (a), all account addresses are mapped to this one and all transactions will be executed here. Further on, if the formula for Nsh dictates the necessity of 2 shards (b), the address space will be split in equal parts, according to the last bits in the address.
fr: L'arborescence présentée n'est qu'une représentation logique de l'espace d'adresse du compte utilisé pour une mise en correspondance déterministe ; par exemple, l'attribution des shards, le calcul des noeuds frères, etc. Les feuilles de l'arbre binaire représentent les shards avec leur numéro ID. En partant de la racine (noeud/partition 0), s'il n'y a qu'une seule partition/feuille (a), toutes les adresses de compte sont associées à celui-ci et toutes les transactions seront exécutées là. Plus loin, si la formule de Nsh impose la nécessité de 2 shards (b), l'espace d'adresse sera divisé en parties égales, en fonction des derniers bits de l'adresse.

source: Sometimes, the tree can also become unbalanced (c) if Nsh
fr: Parfois, l'arbre peut aussi se déséquilibrer (c) si Nsh

source: is not a power of 2. This case only affects the leaves on the last level. The structure will become balanced again when the number of shards reaches a power of 2.
fr: n'est pas une puissance de 2. Ce cas n'affecte que les feuilles du 6ème niveau. La structure redeviendra équilibrée lorsque le nombre de shards atteindra de nouveau une puissance de 2.

source: Fig. 2: Example of a sharding tree structure
fr: Fig. 2 : Exemple d'une structure arborescente de partition

source: The unbalancing of the binary tree causes the shards located in the lowest level to have half the address space of nodes of a shard located one level higher, so it can be argued that the active nodes allocated to these shards will have a lower fee income - block rewards are not affected. However, this problem is solved by having a third of each shard nodes redistributed randomly each epoch (detailed in the Chronology section) and having a balanced distribution of nodes according to the tree level.
fr: Lorsque l'arbre binaire n’est plus équilibré, ceci implique que les shards situés au niveau le plus bas occupent la moitié de l'espace d'adressage des nœuds d'un shard située au niveau du dessus, on peut donc affirmer que les nœuds actifs attribués à ces shards percevront des revenus plus faibles - les récompenses de bloc ne sont pas affectées. Toutefois, ce problème est résolu en distribuant un tiers de chaque nœud de shard de façon aléatoire à travers chaque époque (détaillée dans la Chronologie ) et présentant une répartition équilibrée des nœuds selon le niveau de l'arbre.

source: Looking at the tree, starting from any leaf and going through branches towards the root, the encoding from branches represents the last n bits of the account addresses that will have their associated originating transactions processed by that leaf/shard. Going the other way around, from root to leaf, the information is related to the evolution of the structure, sibling shards, the parent shard from where they split. Using this hierarchy, the shard that will split when Nsh increases or the shards that will merge when Nsh decreases can easily be calculated. The entire state sharding mechanism benefits from this structure by always keeping the address and the associated state within the same shard.
fr: En regardant l'arbre, à partir de n'importe quelle feuille et en progressant le long des branches en direction de la racine, l'encodage des branches correspond aux n derniers bits des adresses de compte qui feront traiter, par cette feuille/shard, leurs transactions d'origine associées. En allant dans l'autre sens, de la racine vers la feuille, l'information est liée au développement de la structure, shards frères, du shard parent d'où ils se séparent. À l'aide de cette hiérarchie, le shard qui se divise lorsque Nsh augmente ou les shards qui fusionnent lorsque Nsh diminue peuvent être facilement calculés. L'ensemble du mécanisme de sharding d'état bénéficie de cette structure en gardant toujours l'adresse et l'état associé dans le même shard..

source: Knowing Nsh, any node can follow the redistribution pro- cess without the need of communication. The allocation of ID’s for the new shards is incremental and reducing the number of shards involves that the higher numbered shards will be removed. For example, when going from Nsh to Nsh-1, two shards will be merged, the shard to be removed is
fr: Connaissant Nsh, n'importe quel nœud peut suivre le processus de redistribution sans avoir besoin de communication. L'allocation des ID pour les nouveaux shards est incrémentale et la réduction du nombre de shards implique que les shards les plus élevés seront supprimés. Par exemple, lorsque vous allez de Nsh à Nsh-1, deux shards seront fusionnés, le shards à supprimer est

source: the highest numbered shard (shmerge=Nsh-1). Finding the shard number that shmerge will be merged with is trivial. According to the tree structure, the resulting shard has the sibling’s number:
fr: le shard numéroté le plus élevé (Shmerge=NSH-1). Trouver le numéro de shard avec lequel shmerge sera fusionné est trivial. Selon la structure de l'arbre, le shard résultant aura le numéro du frère :

source: For shard redundancy, traceability of the state transitions and fast scaling, it is important to determine the sibling and parent of a generic shard with number p:
fr: Pour la redondance des shards, la traçabilité des transitions d'état et le passage à l'échelle rapide, il est important de déterminer le frère et le parent d'un shard générique avec le nombre p :

source: Shard redundancy
fr: redondance des shard

source: 33On blockchain, state sharding is susceptible to shard failure when there is an insufficient number of online nodes in a shard or the distribution is localized geographically. In the unlikely case when one shard fails (either the shard cannot be contacted - all nodes are offline, or consensus cannot be reached - more than 1 of nodes are not responding), there is a high risk that the entire architecture relies only on super- full nodes [2], which fully download every block of every shard, fully verifying everything. As displayed in Fig. 3, our protocol has a protection mechanism that introduces a tradeoff in the state holding structure by enforcing the shards from the last tree level to also hold the state from their siblings. This mechanism reduces the communication and eliminates the bootstrapping when sibling shards are merging since they already have the data.
fr: 33 Sur la blockchain, le partage d'état est exposé aux échecs de shards lorsqu'il y a un nombre insuffisant de nœuds en ligne dans un shard ou que la distribution est localisée géographiquement. Dans le cas peu probable où un shard échoue (soit le shard ne peut pas être contacté - tous les nœuds sont hors-lignes ou un consensus ne peut pas être atteint - plus d'un des nœuds ne répond pas), il y a un risque élevé que l'architecture entière ne repose que sur des nœuds super-pleins [2], qui téléchargent entièrement chaque bloc de chaque shard, vérifiant entièrement tout. Comme le montre la Fig. 3, notre protocole dispose d'un mécanisme de protection qui introduit un compromis dans la structure de maintien de l'état en imposant aux shards du dernier niveau de l'arbre de maintenir également l'état de leurs frères. Ce mécanisme réduit la communication et élimine le bootstrapping lorsque des shards frères fusionnent puisqu'ils ont déjà les données.

source: Context switching
fr: Changement de contexte

source: To preserve security in sharded public blockchains, context switching becomes crucial [7]. This refers to the reallocation of the active nodes between shards on a fixed time interval by some random criteria. In Elrond’s approach, the context switching represents a security improvement, but also increases the complexity required to maintain consistency between multiple states. The state transition has the biggest footprint on performance since the movement of active nodes requires to resync the state, blockchain and transactions along- side the eligible nodes in the new shard.
fr: Pour préserver la sécurité dans blockchains publiques appliquant le sharding, le changement de contexte devient crucial [7]. Cela fait référence à la réaffectation des nœuds actifs entre les shards sur un intervalle de temps fixe selon certains critères aléatoires. Dans l'approche d'Elrond, le changement de contexte apporte une amélioration de la sécurité, mais augmente également la complexité nécessaire pour maintenir la cohérence entre plusieurs états. La transition d'état laisse la plus grande empreinte sur les performances puisque le mouvement des nœuds actifs nécessite de resynchroniser l'état, la blockchain et les transactions en même temps que les nœuds éligibles dans le nouveau shard.

source: Fig. 3: Shard redundancy across epochs
fr: Fig. 3: Redondance des shards à travers les époques

source: At the start of each epoch, in order to maintain liveness, only less than 1 of these nodes will be uniformly re-distributed across shards. This mechanism is highly effective against forming malicious groups.
fr: Au début de chaque époque, afin de maintenir la viabilité, seul moins d'un de ces nœuds sera uniformément redistribué entre les shards. Ce mécanisme est très efficace contre la formation de groupes malveillants.

source: 5 Notarization (Meta) chain
fr: 5 Chaîne de notarisation (Meta)

source: All network and global data operations (node joining the network, node leaving the network, eligible validator lists computation, nodes assignment to the shard’s waiting lists, consensus agreement on a block in a specific shard challenges for invalid blocks will be notarized in the metachain. The metachain consensus is run by a different shard that communicates with all other shards and facilitates cross-shard operations. Every round of every epoch, the metachain receives block headers from the other shards and, if necessary, proofs for the challenges of the invalid blocks. This information will be aggregated into blocks on the metachain on which consensus has to be run. Once the blocks are validated in the consensus group, shards can request information about blocks, miniblocks (see chapter VII), eligible validators, nodes in waiting lists etc., in order to securely process cross-shard transactions. Further details about the cross-shard transaction execution, communication between shards and metachain will be presented in Chapter VII Cross-shard transaction processing.
fr: Toutes les opérations relatives au réseau et aux données globales (nœud rejoignant le réseau, nœud quittant le réseau, calcul des listes de validateurs éligibles, affectation des nœuds aux listes d'attente des shards, accord par consensus sur un bloc dans un shard spécifique, les contestations des blocs non valides) seront notariées dans la métachaîne. Le consensus de la métachaîne est géré par un shard différent qui communique avec tous les autres shard et facilite les opérations entre shards. À chaque tour de chaque époque, la métachaîne reçoit les en-têtes de bloc des autres shards et, si nécessaire, les preuves des contestations des blocs invalides. Ces informations seront regroupées en blocs sur la métachaîne sur lesquels un consensus doit être exécuté. Une fois les blocs validés dans le groupe de consensus, les shards peuvent demander des informations sur les blocs, les miniblocs (voir chapitre VII), les validateurs éligibles, les nœuds des listes d'attente, etc. afin de traiter en toute sécurité les transactions entre shards. De plus amples informations sur l'exécution des opérations croisées entre shards, la communication entre les shards et la métachaîne seront présentées au chapitre VII Traitement des transactions croisées entre shards.

source: V Consensus via Secure Proof of Stake
fr: V Consensus par preuve d'enjeu sécurisée

source: 1 Consensus Analysis
fr: 1 Analyse du consensus

source: The first blockchain consensus algorithm based on Proof of Work (PoW), is used in Bitcoin, Ethereum and other blockchain platforms. In Proof of Work each node is required to solve a mathematical puzzle (hard to calculate but easy to verify). And the first node that finishes the puzzle will collect the reward [18]. Proof of Work mechanisms successfully prevent double-spending, DDoS and Sybil attacks at the cost of high energy consumption.
fr: Le premier algorithme de consensus de blockchain basé sur la Preuve de Travail (Proof of Work = PoW), est utilisé dans Bitcoin, Ethereum et d'autres plates-formes blockchain. Dans la Preuve de Travail, chaque nœud est nécessaire pour résoudre un puzzle mathématique (difficile à calculer mais facile à vérifier). Et le premier nœud qui termine le puzzle recueille la récompense [18]. Les mécanismes de Preuve de Travail permettent d'éviter les doubles dépenses, les attaques DDoS et Sybil au prix d'une consommation d'énergie élevée.

source: Proof of Stake (PoS) is a novel and more efficient consensus mechanism proposed as an alternative to the intensive energy and computational use in Proof of Work consensus mechanisms. PoS can be found in many new architectures like Cardano [19] and Algorand [3] or can be used in next version of Ethereum. In PoS the node that proposes the next block is selected by a combination of stake (wealth), randomness and/or age. It mitigates the PoW energy problem but also puts two important issues on the table: the Nothing at Stake attack and a higher centralization risk.
fr: La Preuve d'Enjeu (PoS = Proof of Stake) est un mécanisme de consensus nouveau et plus efficace proposé comme une alternative à la consommation intensive d'énergie et de puissance de calcul dans les mécanismes de consensus de Preuve de Travail (PoW). La PoS peut être trouvée dans de nombreuses nouvelles architectures comme Cardano [19] et Algorand [3] et peut être dans la prochaine version d'Ethereum. Dans la PoS, le nœud qui propose le bloc suivant est sélectionné par une combinaison d'enjeux (richesse), de tirage aléatoire et/ou d'âge. Cela atténue le problème de l'énergie du PoW mais pose également deux problématique importantes sur la table : l'attaque "Rien à perdre" et un risque de centralisation plus élevé.

source: Proof of Meme as envisioned in Constellation [20], is an algorithm based on the node’s historical participation on the network. Its behaviour is stored in a matrix of weights in the blockchain and supports changes over time. Also, it allows new nodes to gain trust by building up reputation. The main drawback regarding Sybil attacks is alleviated through the NetFlow algorithm.
fr: Proof of Meme, tel qu'il est envisagé dans Constellation [20], est un algorithme basé sur la participation historique du nœud au réseau. Son comportement est stocké dans une matrice de pondération dans la blockchain et prend en charge les changements au fil du temps. Il permet également aux nouveaux nœuds de gagner la confiance des utilisateurs en se forgeant une réputation. Le principal inconvénient des attaques Sybil est atténué par l'algorithme NetFlow.
