Repository: stratej-fr/erlond-doc-fr
Catalog: xliff_erlond-white-paper_elrond-whitepaperdocx_*.xlf
Languages: fr

source: 33Elrond assumes a byzantine adversarial model, where at least 2 n+1 of the eligible nodes in a shard are honest. The protocol permits the existence of adversaries that have stake or good rating, delay or send conflicting messages, compromise other nodes, have bugs or collude among themselves, but as long as 2 n+1 of the eligible validators in a shard are honest/not compromised, the protocol can achieve consensus.
fr: Elrond s’appuie sur un modèle contradictoire byzantin, dans lequel au moins 2 n+1 des nœuds éligibles d'un shard sont honnêtes. Le protocole rend acceptable l'existence d'adversaires qui disposent d’un enjeu ou d’une bonne cote, qui puissent retarder ou envoyer des messages conflictuels, qui compromettent d'autres nœuds, qui présentent des bogues ou qui sont de connivence entre eux, mais tant que 2 n+1 des validateurs éligibles dans un shard sont honnêtes/non compromis, le protocole peut aboutir à un consensus.

source: The protocol assumes highly adaptive adversaries, which however cannot adapt faster than a round’s timeframe. The computational power of an adversary is bounded, therefore the cryptographic assumptions granted by the security level of the chosen primitives hold firmly within the complexity class of problems solvable by a Turing machine in polynomial time. The network of honest nodes is assumed to form a well connected graph and the propagation of their messages is done in a bounded time ∆.
fr: Le protocole présuppose que les adversaires sont hautement adaptables, sans pour autant pouvoir s'adapter plus rapidement que la durée d'un tour. La puissance de calcul d'un adversaire est limitée, c'est pourquoi les hypothèses cryptographiques consenties par le niveau de sécurité des primitives choisies sont prises fermement à l’intérieur de la classe de complexité des problèmes pouvant être résolus par une machine de Turing en temps polynomial. Le réseau des nœuds honnêtes est supposé former un graphe bien connecté et la propagation de leurs messages se fait dans un temps borné ∆.

source: Attack vectors’ prevention
fr: Prévention des vecteurs d'attaque

source: 1) Sybil attacks: mitigated through the stake locking when joining the network. This way the generation of new identities has a cost equal to the minimum stake;
fr: 1) Attaques Sybil : atténuées par le verrouillage de la mise en jeu au moment de rejoindre le réseau. Ainsi, la génération des nouvelles identités présente un coût égal à celui de l'enjeu minimal ;

source: 2) Nothing at stake: removed through the need of multiple signatures, not just from proposer, and the stake slashing. The reward per block compared to the stake locked will discourage such behavior;
fr: 2) Rien en jeu : supprimé de par le besoin en signatures multiples, en plus de celle du proposant, et de par la réduction de l'enjeu. Comparée à la récompense par bloc, l'enjeu verrouillé découragera de tels comportements ;

source: 3) Long range attacks: mitigated by our pruning mech- anism, the use of a randomly selected consensus group every round (and not just a single proposer) and stake locking. On top of all these, our pBFT consensus algo- rithm ensures finality;
fr: 3) Attaques longue distance : atténuées par notre mécanisme d'élagage, et par l'utilisation d'un groupe de consensus sélectionné au hasard à chaque tour (et pas uniquement un seul proposant) ainsi que par le verrouillage de l'enjeu. De plus, notre algorithme de consensus pBFT garantit l’irrévocabilité ;

source: 4) DDoS attacks: the consensus group is randomly sam pled every round (few seconds); the small time frame making DDoS almost impossible.
fr: 4) Les attaques DDoS : le groupe de consensus est échantillonné au hasard à chaque tour (quelques secondes) ; le faible délai rendant le DDoS presque impossible.

source: Other attack vectors we have taken into consideration are: shard takeover attack, transaction censorship, double spend, bribery attacks, etc.
fr: Les autres vecteurs d'attaque que nous avons pris en considération sont : attaque par prise de contrôle des fragments, censure des transactions, doubles dépenses, attaques de corruption, etc.

source: 4 Chronology
fr: 4 Chronologie

source: In Elrond’s network, the timeline is split into epochs and rounds. The epochs have a fixed duration, set to one day (can be modified as the architecture evolves), at the end of which the shards reorganization and pruning is triggered. The epochs are further divided into rounds, lasting for a fixed timeframe. A new consensus group is randomly selected per shard in each round, that can commit a maximum of one block in the shard’s ledger.
fr: Dans le réseau d'Elrond, la chronologie est divisée en époques et en tours. Les époques ont une durée constante, fixée à un jour (peut être modifiée à mesure que l'architecture évoluera), à l'issue de laquelle la réorganisation et l'élagage des fragments sont déclenchés. Les époques sont ensuite divisées en tours, d'une durée fixe. Un nouveau groupe de consensus est sélectionné au hasard par fragment à chaque tour, qui peut valider au maximum un bloc dans le registre du fragment.

source: New validators can join the network by locking their stake, as presented in chapter V.2 - Secure Proof of Stake. They are added to the unassigned node pool in the current epoch e, are assigned to the waiting list of a shard at the beginning of epoch e + 1, but can only become eligible validators to participate in consensus and get rewarded in the next epoch e + 2.
fr: Les nouveaux valideurs peuvent rejoindre le réseau en verrouillant leur enjeu, comme présenté au chapitre V.2 - Preuve d'enjeu sécurisée. Ils sont ajoutés au pool de nœuds non attribués de l'époque courante e, sont inscrits sur la liste d'attente d’un fragment au début de l'époque e + 1, mais ne peuvent devenir des valideurs éligibles pour participer au consensus et être récompensés, uniquement à l'époque e + 2 suivante.

source: The timeline aspects are further detailed in section IX.1.
fr: Les aspects relatifs à la chronologie sont détaillés dans la section IX.1.

source: III Related Work
fr: II Travaux connexes

source: Elrond was designed upon and inspired by the ideas from Ethereum [6], Omniledger [7], Zilliqa [8], Algorand [3] and ChainSpace [9]. Our architecture goes beyond state of the art and can be seen as an augmentation of the existing models, improving the performance while focusing to achieve a better nash equilibrium state between security, scalability and decentralization.
fr: Elrond a été conçu et inspiré par les idées d'Ethereum [6], Omniledger [7], Zilliqa [8], Algorand [3] et ChainSpace [9]. Notre architecture va au-delà de l'état de l'art et peut être considérée comme une augmentation des modèles existants, améliorant les performances tout en se concentrant sur un meilleur équilibre entre sécurité, évolutivité et décentralisation.

source: Much of Ethereum’s [6] success can be attributed to the introduction of its decentralized applications layer through EVM [10], Solidity [11] and Web3j [12]. While Dapps have been one of the core features of ethereum, scalability has proved a pressing limitation. Considerable research has been put into solving this problem, however results have been negligible up to this point. Still, few promising improvements are being proposed: Casper [13] prepares an update that will replace the current Proof of Work (PoW) consensus with a Proof of Stake (PoS), while Plasma based sidechains and sharding are expected to become available in the near future, alleviating Ethereum’s scalability problem at least partially [14].
fr: Une grande partie du succès d'Ethereum [6] peut être attribuée à l'introduction de sa couche d'applications décentralisées par le biais d'EVM [10], Solidity [11] et Web3j [12]. Si les Dapps ont été l'une des caractéristiques essentielles d'Ethereum, l'extensibilité s'est avérée une limitation pressante. Des recherches considérables ont été menées pour résoudre ce problème, mais les résultats ont été négligeables jusqu'à présent. Pour autant, peu d'améliorations prometteuses ont été proposées : Casper [13] prépare une mise à jour qui remplacera le consensus actuel concernant la preuve de travail (proof of work) par une preuve d'enjeu (proof of stake), tandis que les chaînes latérales et les fragments à base de plasma devraient être disponibles dans un avenir proche, ce qui atténuera au moins partiellement le problème d'extensibilité d'Ethereum [14].

source: Compared to Ethereum, Elrond eliminates both energy and computational waste from PoW algorithms by implementing a SPoS consensus while using transaction processing parallelism through sharding.
fr: Comparé à Ethereum, Elrond élimine les gaspilliages énergétiques et informatiques des algorithmes de PoW en mettant en œuvre un consensus SPoS tout en utilisant le parallélisme du traitement des transactions par fragments.

source: 2 Omniledger
fr: 2 Ominiledger

source: Omniledger [7] proposes a novel scale-out distributed ledger that preserves long term security under permission-less op eration. It ensures security and correctness by using a bias- resistant public-randomness protocol for choosing large, statis tically representative shards that process transactions. To commit transactions atomically across shards, Omniledger introduces Atomix, an efficient cross-shard commit protocol.
fr: Omniledger [7] propose un nouveau registre distribué scalable horizontalement qui préserve la sécurité à long terme dans le cadre d'une exploitation libre de permission. Il garantit la sécurité et l'exactitude en utilisant un protocole publique à caractère aléatoire résistant aux biais pour choisir les grands fragments statistiquement représentatifs qui traitent les transactions. Pour engager des transactions de manière atomique entre fragments, Omniledger présente Atomix, un protocole efficace .

source: The concept is a two-phase client-driven ”lock/unlock” protocol that ensures that nodes can either fully commit a transaction across shards, or obtain ”rejection proofs” to abort and unlock the state affected by partially completed transactions. Omniledger also optimizes performance via parallel intra-shard transaction processing, ledger pruning via collectively-signed state blocks, and low-latency ”trust-but-verify” validation for low-value transactions. The consensus used in Omniledger is a BFT variation, named ByzCoinX, that increases performance and robustness against DoS attacks.
fr: Le concept est un protocole de "verrouillage/déverrouillage" à deux phases, piloté par le client, qui garantit que les nœuds peuvent, soit engager complètement une transaction sur des fragments, soit obtenir des "preuves de rejet" pour interrompre et déverrouiller l'état affecté par des transactions partiellement achevées. Omniledger optimise également les performances grâce au traitement parallèle des transactions intra-fragments, à l'élagage du grand livre par le biais de blocs d'état signés collectivement et à la validation à faible latence "faire confiance mais vérifier" pour les transactions de faible valeur. Le consensus utilisé dans Omniledger est une variante de BFT, appelée ByzCoinX, qui augmente les performances et la robustesse contre les attaques de déni de service.

source: Compared to Omniledger, Elrond has an adaptive approach on state sharding, a faster random selection of the consensus group and an improved security by replacing the validators’ set after every round (a few seconds) not after every epoch (1 day).
fr: Par rapport à Omniledger, Elrond a une approche adaptative du partage d'État, une sélection aléatoire plus rapide du groupe de consensus et une sécurité améliorée en remplaçant l'ensemble des validateurs après chaque tour (quelques secondes) et non après chaque époque (1 jour).

source: Zilliqa [8] is the first transaction-sharding architecture that allows the mining network to process transactions in parallel and reach a high throughput by dividing the mining network into shards. Specifically, its design allows a higher transaction rate as more nodes are joining the network. The key is to ensure that shards process different transactions, with no overlaps and therefore no double-spending. Zilliqa uses pBFT [15] for consensus and PoW to establish identities and prevent Sybil attacks.
fr: Zilliqa [8] est la première architecture de partitionnement des transactions permettant au réseau minier de traiter les transactions en parallèle et d'atteindre un débit élevé en divisant le réseau minier en fragments. Plus précisément, sa conception permet un taux de transaction plus élevé à mesure que de nouveaux nœuds rejoignent le réseau. L'essentiel est de veiller à ce que les fragments traitent des transactions différentes, sans chevauchement et donc sans double dépense. Zilliqa utilise le pBFT [15] pour le consensus et le PoW pour établir les identités et prévenir les attaques de type Sybil.

source: Compared to Zilliqa, Elrond pushes the limits of sharding by using not only transaction sharding but also state sharding. Elrond completely eliminates the PoW mechanism and uses SPoS for consensus. Both architectures are building their own smart contract engine, but Elrond aims not only for EVM compliance, so that SC written for Ethereum will run seamlessly on our VM, but also aims to achieve interoperability between blockchains.
fr: Par rapport à Zilliqa, Elrond repousse les limites du partitionnement en utilisant, non seulement le partitionnement de transaction, mais aussi le partitionnement d'État. Elrond élimine complètement le mécanisme du PoW et utilise le SPoS pour le consensus. Les deux architectures construisent leur propre moteur de contrat intelligent, mais Elrond vise non seulement la conformité EVM, de sorte que le SC écrit pour Ethereum fonctionne de manière transparente sur notre VM, mais vise également à réaliser l'interopérabilité entre les blockchains.

source: Algorand [3] proposes a public ledger that keeps the convenience and efficiency of centralized systems, without the inefficiencies and weaknesses of current decentralized implementations. The leader and the set of verifiers are randomly chosen, based on their signature applied to the last block’s quantity value. The selections are immune to manipulations and unpredictable until the last moment. The consensus relies on a novel message-passing Byzantine Agreement that enables the community and the protocol to evolve without hard forks. Compared to Algorand, Elrond doesn’t have a single blockchain, instead it increases transaction’s throughput using sharding. Elrond also improves on Algorand’s idea of random selection by reducing the selection time of the consensus group from over 12 seconds to less than a second, but assumes that
fr: Algorand [3] propose un grand livre public qui conserve la commodité et l'efficacité des systèmes centralisés, sans les inefficacités et les faiblesses des mises en œuvre décentralisées actuelles. Le chef et l'ensemble des vérificateurs sont choisis au hasard, en fonction de leur signature appliquée à la valeur de la quantité du dernier bloc. Les sélectionnés sont à l'abri des manipulations et imprévus jusqu'au dernier moment. Le consensus repose sur un nouvel accord byzantin de transmission de messages qui permet à la communauté et au protocole d'évoluer sans bifurquer. Par rapport à Algorand, Elrond n'a pas de blockchain unique, mais augmente le débit des transactions grâce aux fragments. Elrond améliore également l'idée de sélection aléatoire d'Algorand en réduisant le temps de sélection du groupe de consensus de plus de 12 secondes à moins d'une seconde, mais suppose que

source: the adversaries cannot adapt within a round.
fr: les adversaires ne peuvent pas s'adapter au cours d'un tour.

source: Compared to Chainspace, where the TPS decreases with each node added in a shard, Elrond’s approach is not influenced by the number of nodes in a shard, because the consensus group has a fixed size. A strong point for Chainspace is the approach for language agnostic smart contracts, while Elrond focuses on building an abstraction layer for EVM compliance. Both projects use different approaches for state sharding to enhance performance. However, Elrond goes a step further by anticipating the blockchain size problem in high throughput architectures and uses an efficient pruning mechanism. Moreover, Elrond exhibits a higher resistance to sudden changes in node population and malicious shard takeover by introducing shard redundancy, a new feature for sharded blockchains.
fr: Par rapport à Chainspace, où le TPS diminue avec chaque nœud ajouté dans une shard, l'approche d'Elrond n'est pas influencée par le nombre de nœuds dans celle-ci, car le groupe de consensus a une taille fixe. Un point fort de Chainspace est l'approche des contrats intelligents agnostiques au langage, tandis qu'Elrond se concentre sur la construction d'une couche d'abstraction pour la conformité EVM. Les deux projets utilisent des approches différentes pour les fragments d'État afin d'améliorer les performances. Cependant, Elrond va plus loin en anticipant le problème de la taille des blockchains dans les architectures à haut débit et utilise un mécanisme d'élagage efficace. En outre, Elrond présente une plus grande résistance aux changements soudains de la population de nœuds et à la prise de contrôle malveillante des shards en introduisant la redondance des fragment, une nouvelle fonctionnalité pour les chaînes de blocs fragmentées.

source: IV Scalability via Adaptive State Sharding
fr: IV Scalabilité via partitionnement d’état adaptatif

source: 1 Why sharding
fr: 1 Pourquoi partitionner horizontalement ?

source: Sharding was first used in databases and is a method for distributing data across multiple machines. This scaling technique can be used in blockchains to partition states and transaction processing, so that each node would process only a fraction of all transactions in parallel with other nodes. As long as there is a sufficient number of nodes verifying each transaction so that the system maintains high reliability and security, then splitting a blockchain into shards will allow it to process many transactions in parallel, and thus greatly improving transaction throughput and efficiency. Sharding promises to increase the throughput as the validator network expands, a property that is referred to as horizontal scaling.
fr: A l’origine, le partitionnement était utilisé dans les bases de données en tant que méthode de distribution des données entre plusieurs machines. Cette technique de passage à l'échelle peut être appliquée à la blockchain pour partitionner les états et le traitement des transactions, de sorte à ce que chaque nœud ne traite qu'une fraction de toutes les transactions en parallèle avec les autres nœuds. Tant qu'il y a un nombre de nœuds suffisant, et qui vérifient chaque transaction afin que le système maintienne une fiabilité et une sécurité élevées, dans ces conditions, le découpage d'une blockchain donnée, en partitions horizontales lui permettra de traiter de nombreuses transactions en parallèle, et donc d'améliorer considérablement le débit des transactions ainsi que l’efficacité des traitements. La promesse du partitionnement est de pouvoir augmenter le débit au fur et à mesure que le réseau de valideurs s'étend, c’est une propriété designée sous le nom de scalabilité horizontale..

source: 2 Sharding types
fr: 2 Types de sharding

source: A comprehensive and thorough introduction [16] emphasizes the three main types of sharding: network sharding, transaction sharding and state sharding. Network sharding handles the way the nodes are grouped into shards and can be used to optimize communication, as message propagation inside a shard can be done much faster than propagation to the entire network. This is the first challenge in every sharding approach and the mechanism that maps nodes to shards has to take into consideration the possible attacks from an attacker that gains control over a specific shard. Transaction sharding handles the way the transactions are mapped to the shards where they will be processed. In an account-based system, the transactions could be assigned to shards based on the sender’s address. State sharding is the most challenging approach. In contrast to the previously described sharding mechanisms, where all nodes store the entire state, in state- sharded blockchains, each shard maintains only a portion of the state. Every transaction handling accounts that are in different shards, would need to exchange messages and update states in different shards. In order to increase resiliency to malicious attacks, the nodes in the shards have to be reshuffled from time to time. However, moving nodes between shards introduces synchronization overheads, that is, the time taken for the newly added nodes to download the latest state. Thus,it is imperative that only a subset of all nodes should be redistributed during each epoch, to prevent down times during the synchronization process.
fr: Une introduction complète et détaillée [16] met l'accent sur les trois principaux types sharding : sharding de réseau, sharding de transaction, et sharding d’état. Le sharding de réseau gère la façon dont les nœuds sont regroupés en shard et peut être utilisé pour optimiser la communication, car la propagation des messages à l'intérieur d'un shard peut se faire beaucoup plus rapidement que la propagation à l'ensemble du réseau. C'est le premier défi dans chaque approche de sharding et le mécanisme qui fait correspondre les nœuds aux shard doit prendre en considération les attaques possibles d'un attaquant qui prend le contrôle d'un shard spécifique. Le sharding de transaction gère la manière dont les transactions sont mises en correspondance avec les shards où elles seront traitées. Dans un système basé sur des comptes, les transactions pourraient être attribuées à des shards en fonction de l'adresse de l'expéditeur. L'approche la plus difficile est celle du sharding d’état. Contrairement aux mécanismes de découpage en shards décrits précédemment, où tous les nœuds stockent l'état complet, dans les blockchains découpées horizontalement en shards d’état, chaque shard ne maintient qu'une partie de l’état. Chaque transaction traitant des comptes qui se trouvent dans des shards différente, devrait échanger des messages et mettre à jour les états dans des shards différents. Afin d'accroître la résilience aux attaques malveillantes, les nœuds des shards doivent être re-mélangés de temps en temps. Cependant, le déplacement des nœuds entre les shards introduit des coûts de synchronisation, qui correspond au temps nécessaire pour que les nœuds nouvellement ajoutés puissent télécharger le dernier état. Ainsi, il est impératif que seul un sous-ensemble de tous les nœuds soit redistribué à chaque époque, pour éviter les temps d'arrêt pendant le processus de synchronisation.

source: 3 Sharding directions
fr: 3 Les tendances du sharding
