Repository: stratej-fr/erlond-doc-fr
Catalog: xliff_erlond-white-paper_elrond-whitepaperdocx_*.xlf
Languages: fr

source: Let L = P k1, P k2, ..., P kn be the set of public keys of all possible signers during a specific round which, in the case of Elrond, is the set of public keys of all the nodes in the consensus group. Below, the two stages of block signing process is presented: signing and verification.
fr: Soit L = P k1, P k2, ..., P kn est l'ensemble des clés publiques de tous les signataires possibles au cours d'un tour spécifique qui, dans le cas d'Elrond, est l'ensemble des clés publiques de tous les nœuds du groupe de consensus. Les deux étapes du processus de signature en bloc sont présentées ci-dessous : la signature et la vérification.

source: Practical signing - Round 1
fr: Signature pratique - Cycle 1

source: The leader of the consensus group creates a block with transactions, then signs and broadcasts this block to the consensus group members.
fr: Le chef du groupe de consensus crée un bloc avec les transactions, puis signe et diffuse ce bloc aux membres du groupe de consensus.

source: Practical signing - Round 2
fr: Signature pratique - Cycle 2

source: Each member of the consensus group (including the leader) who receives the block must validate it, and if found valid, it signs it with BLS and then sends the signature to the leader:
fr: Chaque membre du groupe de consensus (y compris le chef) qui reçoit le bloc doit le valider, et s'il le trouve valide, il le signe avec le BLS et envoie ensuite la signature au chef :

source: where Sigi is a point on g0.
fr: Où Sigi est un point sur g0

source: Practical signing - Round 3
fr: Signature pratique - Cycle 3

source: 3333The leader waits to receive the signatures for a specific timeframe. If it does not receive at least 2 · n + 1 signatures in that timeframe, the consensus round is aborted. But if the leader does receive 2 · n + 1 or more valid signatures, it uses them to generate the aggregated signature:
fr: Le chef du groupe attend de recevoir les signatures pendant une période déterminée. S'il n'en reçoit pas au moins 2 - n + 1 signatures dans ce délai, le cycle de consensus est avorté. Mais si le leader reçoit 2 - n + 1 ou plus de signatures valables, il les utilise pour générer la signature agrégée :

source: where SigAgg is a point on g0.
fr: Où SigAgg est un point sur g0

source: The leader then adds the aggregated signature to the block together with the selected signers bitmap B, where a 1 indicates that the corresponding signer in the list L had its signature added to the aggregated signature SigAgg.
fr: Le leader ajoute ensuite la signature agrégée au bloc avec les signataires sélectionnés en bitmap B, où un 1 indique que le signataire correspondant dans la liste L a vu sa signature ajoutée à la signature agrégée SigAgg.

source: Practical verification
fr: Vérification pratique

source: Given the list of public keys L, the bitmap for the signers B, the aggregated signature SigAgg, and a message m (block), the verifier computes the aggregated public key:
fr: Compte tenu de la liste des clés publiques L, de la bitmap des signataires B, de la signature agrégée SigAgg et d'un message m (bloc), le vérificateur calcule la clé publique agrégée :

source: The result, P kAgg, is a point on g1. The final verification is where e is the pairing function.
fr: Le résultat, P kAgg, est un point sur g1. La vérification finale est l'endroit où e est la fonction d'appariement.

source: VII Cross-shard Execution
fr: VII Exécution inter shards

source: For an in depth example of how the cross-shard transactions are being executed and how the communication between shards and the metachain occurs, we are simplifying the entire process to just two shards and the metachain. Assuming that a user generates a transaction from his wallet, which has an address in shard 0 and wants to send ERDs to another user that has a wallet with an address in shard 1, the steps depicted in Fig. 4 are required for processing the cross-shard transaction. As mentioned in chapter V - Consensus via Secure Proof of Stake, the blocks structure is represented by a block Header that contains information about the block (block nonce, round, proposer, validators timestamp etc), and a list of miniblocks for each shard that contain the actual transactions inside. Every miniblock contains all transactions that have either the sender in the current shard and the receiver in another shard or the sender in a different shard and the destination in the current shard. In our case, for a block in shard 0, there will normally be 3 miniblocks:
fr: Pour un exemple approfondi de la manière dont les opérations inter shards sont exécutées et illustrer comment la communication entre les shards et la métachaîne se déroulent, nous simplifierons l'ensemble du processus pour ne mettre en jeu que deux shards adossés à la métachaîne. En supposant qu'un utilisateur génère une transaction à partir de son portefeuille, qui a une adresse dans le shard 0 et souhaite envoyer des ERD à un autre utilisateur qui a un portefeuille avec une adresse dans le shard 1, les étapes décrites dans la figure 4 sont nécessaires pour traiter la transaction inter shards. Comme mentionné dans le chapitre V - Consensus via preuve d'enjeu sécurisée, la structure des blocs est représentée par un en-tête de bloc qui rassemble des informations sur le bloc (nombre ad hoc du bloc = "nonce" du bloc, tour, proposant, horodatage des validateurs, etc.), et une liste de miniblocs de chaque shard à l'intérieur duquel sont contenues les transactions en question. Chaque minibloc contient toutes les transactions qui ont soit l'émetteur dans le shard actuel et le récepteur dans un autre shard, soit l'émetteur dans un shard différent et la destination dans le shard actuel. Dans notre cas, pour un bloc dans le shard 0, il y aura normalement 3 miniblocs :

source: • miniblock 0: containing the intrashard transactions for shard 0
fr: • miniblock 0 : contenant les transactions intra shard pour le shard 0

source: • miniblock 1: containing cross-shard transactions with the sender in shard 0 and destination in shard 1
fr: • miniblock 1 : contenant les transactions inter shards avec l'expéditeur dans le shard 0 et la destination dans le shard 1

source: • miniblock 2: containing cross-shard transactions with sender in shard 1 and destination in shard 0. These transactions were already processed in the sender shard 1 and will be finalized after the processing also in the current shard.
fr: • miniblock 2 : contenant les transactions inter shards avec l'expéditeur dans le shard 1 et la destination dans le shard 0. Ces transactions ont déjà été traitées dans le shard de l'expéditeur 1 et seront également finalisées après le traitement dans le shard courant.

source: There is no limitation on the number of miniblocks with the same sender and receiver in one block. Meaning multiple miniblocks with the same sender and receiver can appear in the same block.
fr: Il n'y a pas de limite sur le nombre de miniblocs avec le même expéditeur et le même récepteur dans un bloc. Ce qui signifie que plusieurs miniblocs avec le même expéditeur et le même récepteur peuvent apparaître dans le même bloc.

source: 1 Processing
fr: 1 Traitement

source: Currently the atomic unit of processing in cross-shard execution is a miniblock: either all the transactions of the miniblock are processed at once or none and the miniblock’s execution will be retried in the next round.
fr: Actuellement, l'unité atomique de traitement inter shard est le minibloc : soit toutes les transactions du minibloc sont traitées en même temps, soit aucune, et l'exécution du minibloc sera retentée au tour suivant.

source: Our cross-shard transaction strategy uses and asynchronous model. Validation and processing is done first in sender’s shard and then in receivers’ shard. Transactions are first dispatched in the sender’s shard, as it can fully validate any transaction initiated from the account in this shard – mainly the current balance. Afterwards, in the receivers’ shard, the nodes only need proof of execution offered by metachain, do signature verification and check for replay attack and finally update the balance for the receiver, adding the amount from the transaction.
fr: Notre stratégie de transactions inter shards utilise un modèle asynchrone. La validation et le traitement sont effectués d'abord dans le shard de l'expéditeur, puis dans le shard du destinataire. Les transactions sont d'abord expédiées dans le shard de l'expéditeur, car il peut valider entièrement toute transaction initiée à partir du compte dans ce shard - principalement le solde courant. Ensuite, dans le tesson du récepteur, les nœuds n'ont besoin que de la preuve d'exécution offerte par la métachaîne, font la vérification de la signature et vérifient l'absence d'attaque par rediffusion et enfin mettent à jour le solde pour le récepteur, en ajoutant le montant de la transaction.

source: Shard 0 processes both intra-shard transactions in miniblock 0 and a set of cross-shard transactions that have addresses from shard 1 as a receiver in miniblock 1. The block header and miniblocks are sent to the metachain. The metachain notarizes the block from shard 0, by creating a new metachain block (metablock) that contains the following information about each miniblock: sender shard ID, receiver shard ID, miniblock hash.
fr: Le shard 0 traite à la fois les transactions intra shard dans le minibloc 0 et un ensemble de transactions inter shard qui ont des adresses du shard 1 comme récepteur dans le minibloc 1. L'en-tête du bloc et les miniblocs sont envoyés à la métachaîne. La métachaîne notifie le bloc du shard 0, en créant un nouveau bloc de métachaîne (metablock) qui contient les informations suivantes sur chaque minibloc : ID du shard émetteur, ID du shard récepteur, hachage du minibloc.

source: Fig. 4: Cross-shard transaction processing
fr: Figure 4 : Traitement des transactions inter shards

source: Shard 1 fetches the hash of miniblock 1 from metablock, requests the miniblock from shard 0, parses the transaction list, requests missing transactions (if any), executes the same miniblock 1 in shard 1 and sends to the metachain resulting block. After notarization the cross transaction set can be considered finalized.
fr: Le shard 1 récupère le hachage du minibloc 1 dans le métabloc, demande le minibloc du shard 0, analyse la liste des transactions, requête les transactions manquantes (le cas échéant), exécute le même minibloc 1 dans le shard 1 et envoie au bloc résultant de la métachaîne. Après la notarisation, l'ensemble des transactions inter shards peut être considéré comme finalisée.

source: The next diagram shows the number of rounds required for a transaction to be finalized. The rounds are considered between the first inclusion in a miniblock until the last miniblock is notarised.
fr: Le diagramme suivant montre le nombre de tours nécessaires pour qu'une transaction soit finalisée. Les tours sont comptabilisés entre la première inclusion dans un minibloc et la notarisation du dernier minibloc.

source: The execution of smart contracts is a key element in all future blockchain architectures. Most of the existing solutions avoid to properly explain the transactions and data dependency. This context leads to the following two scenarios:
fr: L'exécution de smart contracts est un élément clé pour toutes les futures architectures de chaînes de blocs. La plupart des solutions existantes évitent de clarifier correctement les dépendances entre les transactions et les données. Ce contexte conduit aux deux scénarios suivants :

source: 1) When there is no direct correlation between smart con- tract transactions, as displayed in Fig. 5, any architecture can use out of order scheduling. This means there are no additional constraints on the time and place (shard) where a smart contract is executed.
fr: 1) Lorsqu'il n'y a pas de corrélation directe entre les transactions des smart contracts, comme le montre la figure 5, toute architecture peut utiliser un ordonnancement qui ne garantit pas l'ordre. Cela signifie qu'il n'y a pas de contraintes supplémentaires ni sur le moment, ni sur le lieu (shard) où un smart contract est exécuté.

source: 2) The second scenario refers to the parallelism induced by the transactions that involve correlated smart contracts [37]. This case, reflected in Fig. 6, adds additional pressure on the performance and considerably increases the complexity. Basically there must be a mechanism to ensure that contracts are executed in the right order and on the right place (shard). To cover this aspect, Elrond protocol proposes a solution that assigns and moves the smart contract to the same shard where their static dependencies reside. This way most, if not all SC calls will have dependencies in the same shard and no cross-shard locking/unlocking will be needed.
fr: 2) Le second scénario fait référence au parallélisme induit par les transactions qui impliquent des smart contracts corrélés [37]. Ce cas, illustré à la figure 6, ajoute une pression supplémentaire sur les performances et augmente considérablement la complexité. Fondamentalement, il doit y avoir un mécanisme permettant de s'assurer que les contrats sont exécutés dans le bon ordre et au bon endroit (shard). Pour couvrir cet aspect, le protocole Elrond propose une solution qui assigne et déplace le smart contract vers le shard même qui maintient ses dépendances statiques. De cette façon, la plupart, voire la totalité des appels Smart Contracts auront des dépendances réduites au même shard et aucun verrouillage/déverrouillage inter shards ne sera nécessaire.

source: Elrond focuses on the implementation of the Elrond Virtual Machine, an EVM compliant engine. The EVM compliance
fr: Elrond se concentre sur la mise en œuvre de la machine virtuelle Elrond, un moteur conforme à la norme EVM. La conformité EVM

source: Fig. 5: Independent transaction processing under simple smart contracts that can be executed out of order
fr: Fig. 5: Traitement indépendant des transactions dans le cadre de smart contracts simples qui peuvent être exécutés sans garantir l'ordre

source: Fig. 6: Mechanism for correlated smart contracts that can be executed only sequentially
fr: Figure 6 : Mécanisme pour les smart contracts corrélés qui peuvent uniquement être exécutés séquentiellement

source: Fig. 7: Abstraction Layer for Smart Contracts
fr: Fig. 7 : Couche d'abstraction pour les smart contracts

source: is extremely important for adoption purposes, due to the large number of smart contracts built on Ethereum’s platform.
fr: est extrêmement importante à des fins d'adoption, en raison du grand nombre de smart contracts construits sur la plateforme d'Ethereum.

source: The Elrond Virtual Machine’s implementation will hide theunderlying architecture isolating the smart contract developers from system internals ensuring a proper abstraction layer, as displayed in Fig. 7.
fr: L'implémentation de la machine virtuelle Elrond masquera l'architecture sous-jacente isolant les développeurs de smart contracts des systèmes internes assurant ainsi une couche d'abstraction appropriée, comme illustré à la figure 7.

source: In Elrond, cross chain interoperability can be implemented by using an adapter mechanism at the Virtual Machine level as proposed by Cosmos [38]. This approach requires specialized adapters and an external medium for communication between adapter SC for each chain that will interoperate with Elrond. The value exchange will be operated using some specialized smart contracts acting as asset custodians, capable of taking custody of adapted chain native tokens and issuing Elrond native tokens.
fr: Dans Elrond, l'interopérabilité entre chaînes peut être mise en œuvre en utilisant un mécanisme d'adaptation au niveau de la machine virtuelle, comme le propose Cosmos [38]. Cette approche nécessite des adaptateurs spécialisés et un moyen de communication externe entre les adaptateurs Smart Contracts pour chaque chaîne qui interopérera avec Elrond. L'échange de valeur sera opéré à l'aide de certains smart contracts spécialisés agissant en tant que dépositaires, aptes à assurer la garde des jetons natifs de la chaîne ainsi adaptée et d'émettre des jetons natifs Elrond.

source: 1 VM Infrastructure
fr: 1 infrastructure de machines virtuelles

source: Elrond builds its VM infrastructure on top of the K Frame- work, which is an executable semantic framework where programming languages, calculi, as well as type systems or formal analysis tools can be defined [39].
fr: Elrond construit son infrastructure de Machines Virtuelles au dessus du Framework K, qui est un framework sémantique exécutable permettant de définir des langages de programmation, de calculs, ainsi que des systèmes de types ou des outils d'analyse formels [39].

source: The greatest advantage of using the K framework is that with it, smart contract languages can be unambiguously de- fined, eliminating the potential for unspecified behavior and bugs that are hard to detect.
fr: Le plus grand avantage de l'utilisation du Framework K c'est qu'avec lui, les langages des smarts contract peuvent être définis de manière non- ambiguë, ce qui élimine le risque de comportements non spécifiés et de bogues difficiles à détecter.

source: The K Framework is executable, in the sense that the semantic specifications of languages can be directly used as working interpreters for the languages in question. More specifically, one can either run programs against the specifications using the K Framework core implementation directly, or one can generate an interpreter in several programming languages. These are also referred to as ”backends”. For the sake of execution speed and ease of interoperability, Elrond uses its own custom-built K Framework backend.
fr: Le Framework K est exécutable, en ce sens que les spécifications sémantiques des languages peuvent être utilisé directement comme des interpréteurs de langages opérationnels. Plus précisément, on peut soit exécuter des programmes en fonction des spécifications en utilisant directement l'implémentation coeur du Framework K, soit générer un interpréteur dans plusieurs langages de programmation différents. Ces derniers sont également appelés "backends". Pour des raisons de rapidité d'exécution et de facilité d'interopérabilité, Elrond utilise son propre backend du Framework K, qui est construit sur mesure.

source: 2 Smart contract languages
fr: 2 Languages des Smart Contracts

source: One great advantage of the K Framework is that one can generate an interpreter for any language defined in K, without the need for additional programming. This also means that interpreters produced this way are ”correct-by-construction”.
fr: Un grand avantage du framework K est que l'on peut générer un interpréteur pour n'importe quelle langue définie en K, sans avoir besoin de programmation supplémentaire. Cela signifie également que les interpréteurs produits de cette manière sont "corrects par construction".

source: There are several smart contract languages specified in the K Framework already, or with their specifications under develop- ment. Elrond Network will support three low-level languages: IELE VM, KEVM, and WASM.
fr: Il existe déjà plusieurs langages de smart contracts spécifiés dans le Framework K, ou dont les spécifications sont en cours d'élaboration. Le réseau Elrond prendra en charge trois langages de bas niveau : IELE VM, KEVM et WASM.

source: • IELE VM is an intermediate-level language, in the style of LLVM, but adapted for the blockchain. It was built directly in K, no other specification or implementation of it exists outside of the K framework [40]. Its purpose is to be human readable, fast, and to overcome some limitations of EVM. Elrond uses a slightly altered version of IELE - most changes are related to account address management. Smart contract developers can program in IELE directly, but most will choose to code in Solidity and then use a Solidity to IELE compiler, as can be seen in Fig. 8.
fr: - IELE VM est un langage de niveau intermédiaire, dans le style de LLVM, mais adapté à la chaîne de blocs. Il a été construit directement en K, aucune autre spécification ou implémentation de celui-ci n'existe en dehors du framework K [40]. Son but est d'être lisible par l'homme, rapide, et de surmonter certaines limitations de l'EVM. Elrond utilise une version légèrement modifiée d'IELE - la plupart des changements sont liés à la gestion des adresses des comptes. Les développeurs de smart contracts peuvent programmer directement en IELE, mais la plupart choisiront de coder en Solidity et d'utiliser ensuite un compilateur Solidity to IELE, comme on peut le voir sur la figure 8.

source: • KEVM is a version of the Ethereum Virtual Machine (EVM), written in K [41]. Certain vulnerabilities of EVM are fixed in the K version, or the vulnerable features are left out entirely.
fr: - KEVM est une version de la machine virtuelle Ethereum (EVM), écrite en K [41]. Certaines vulnérabilités de l'EVM sont corrigées dans la version en K, et les fonctionnalités vulnérables sont entièrement écartées.

source: • Web Assembly (WASM) is a binary instruction format for a stack-based virtual machine, which can be used for running smart contracts. A WASM infrastructure enables developers to write smart contracts in C/C++, Rust, C#, and others.
fr: - Le Web Assembly (WASM) est un format d'instruction binaire, destiné aux machines virtuelles à mémoire de pile, qui peut être utilisé pour exécuter des smart contracts. Une infrastructure WASM permet aux développeurs d'écrire des smart contracts en C/C++, Rust, C#, et autres

source: Having a language specification and generating the inter- preter is only half of the challenge. The other half is integrating the generated interpreter with the Elrond network. We have built a common VM interface, that enables us to plug in any VM into an Elrond node as shown in Fig. 9. Each VM then has an adapter that implements this interface. Each contract is saved as bytecode of the VM for which it was compiled and runs on its corresponding VM.
fr: Avoir une spécification linguistique et générer l'inter-préteur n'est que la moitié du défi. L'autre moitié consiste à intégrer l'interprète généré au réseau Elrond. Nous avons construit une interface VM commune, qui nous permet de connecter n'importe quelle VM à un nœud Elrond, comme le montre la figure 9. Chaque VM dispose alors d'un adaptateur qui met en œuvre cette interface. Chaque contrat est enregistré comme bytecode de la VM pour laquelle il a été compilé et fonctionne sur sa VM correspondante.

source: 3 Support for formal modelling and verification
fr: 3 Assistance à la modélisation et à la vérification formelles

source: Because the smart contract languages are formally defined in K Framework, it is possible to perform formal verification of smart contracts written in these languages. To do this, it is necessary to also formally model their requirements, which can also be performed using the K Framework [42].
fr: Comme les langages des smart contracts sont formellement définis dans le cadre K, il est possible de procéder à une vérification formelle des smart contracts rédigés dans ces langages. Pour ce faire, il est nécessaire de modéliser formellement leurs exigences, ce qui peut également être fait en utilisant le Cadre K [42].

source: Fig. 8: Elrond VM execution
fr: Fig. 8 : Exécution de la Machine Virtuelle Elrond

source: Fig. 9: Elrond VM components
fr: Fig. 9 : Composants de la Machine Virtuelle Elrond

source: 4 Smart contracts on the sharded architecture
fr: 4 Smart Contracts sur une architecture de shards
