Repository: stratej-fr/erlond-doc-fr
Catalog: xliff_erlond-white-paper_elrond-whitepaperdocx_*.xlf
Languages: fr

source: 33same round in the same consensus is 10−9, even if 33% of the nodes from the shard are malicious. In that case they can propose a block and sign it - let’s call it block m, but it will not be notarized by the metachain. The metachain notarizes block m, only if block m + 1 is built on top of it. In order to create block m+1 the next consensus group has to agree with block m. Only a malicious group will agree with block m, so the next group must have a malicious super majority again. As the random seed for group selection cannot be tampered with, the probability of selecting one more malicious super majority group is 10−9 (5.38 · 10−10, to be exact). The probability of signing two consecutive malicious blocks equals with selecting two subgroups with at least (2 · n+1) members from the malicious group consequently. The probability for this is 10−18. Furthermore, the consequently selected groups must be colluding, otherwise the blocks will not be signed.
fr: Le même tour dans le même consensus est de 10-9, même si 33% des nœuds de la shard sont malveillants. Dans ce cas, ils peuvent proposer un bloc et le signer - appelons-le bloc m-, mais il ne sera pas notarié par la métachaîne. La métachaîne ne notifie le bloc m que si le bloc m + 1 est construit par-dessus. Afin de créer le bloc m+1, le groupe de consensus suivant doit être d'accord avec le bloc m. Seul un groupe malveillant sera d'accord avec le bloc m, donc le groupe suivant doit à nouveau avoir une super majorité malveillante. Comme la séquence aléatoire pour la sélection du groupe ne peut être modifiée, la probabilité de sélectionner un autre groupe super majoritaire malveillant est de 10-9 (5,38 - 10-10, pour être exact). La probabilité de signer deux blocs malveillants consécutifs est égale à la sélection de deux sous-groupes comportant au moins (2 - n+1) membres du groupe malveillant en conséquence. La probabilité pour cela est de 10-18. En outre, les groupes sélectionnés en conséquence doivent être de connivence, sinon les blocs ne seront pas signés.

source: 4 Fisherman challenge
fr: 4 Le défi du pêcheur

source: When one invalid block is proposed by a malicious majority, the shard state root is tampered with an invalid result (after including invalid changes to the state tree). By providing the combined merkle proof for a number of accounts, an honest node could raise a challenge with a proof. The honest nodes will provide the block of transactions, the previous reduced merkle tree with all affected accounts before applying the challenged block and the smart contract states, thus demon- strating the invalid transaction / state. If a challenge with the proof is not provided in the bounded time frame, the block is considered valid. The cost of one invalid challenge is the entire stake of the node which raised the challenge.
fr: Lorsqu'un bloc invalide est proposé par une majorité malveillante, la racine de l'état de la shard est altérée avec un résultat invalide (après avoir inclus des modifications invalides à l'arbre d'état). En fournissant la preuve du merkle combiné pour un certain nombre de comptes, un nœud honnête pourrait soulever un défi avec une preuve. Les nœuds honnêtes fourniront le bloc de transactions, l'arbre de merkle réduit précédent avec tous les comptes affectés avant d'appliquer le bloc contesté et les états de contrat intelligents, ce qui permet de démonter la transaction/état invalide. Si une contestation avec la preuve n'est pas fournie dans le délai imparti, le bloc est considéré comme valide. Le coût d'une contestation non valable correspond à la totalité de l'enjeu du nœud qui a soulevé la contestation.

source: The metachain detects the inconsistency, either an invalid transaction, or an invalid state root, through the presented challenges and proofs. This can be traced and the consensus group can be slashed. At the same time the challenger can be rewarded with part of the slashed amount. Another problem is when a malicious group hides the invalid block from other nodes - non-malicious ones. However, by making it mandatory for the current consensus to propagate the produced block to the sibling shard and to the observer nodes, the data cannot be hidden anymore. The communication overhead is further reduced by sending only the intrashard miniblock to the sibling shard. The cross shard miniblocks are always sent on different topics accessible by interested nodes. In the end, challenges can be raised by multiple honest nodes. Another security pro- tection is given by the setup of P2P topics. The communication from one shard toward the metachain is done through a defined set of topics / channels, which can be listened to by any honest validator - the metachain will not accept any other messages from other channels. This solution introduces some delay in the metachain only in case of challenges, which are very low in number and highly improbable since if detected (high probability of being detected) the nodes risk their entire stake.
fr: La métachaîne détecte l'incohérence, soit une transaction non valide, soit une racine d'état non valide, grâce aux défis et aux preuves présentés. Elle permet de remonter à la source de l'incohérence et de réduire le groupe de consensus. Dans le même temps, le challenger peut être récompensé par une partie du montant réduit. Un autre problème se pose lorsqu'un groupe malveillant cache le bloc invalide à d'autres nœuds - non malveillants. Cependant, en rendant obligatoire, dans le cadre du consensus actuel, la propagation du bloc produit aux shards soeurs et aux nœuds observateurs, les données ne peuvent plus être cachées. La surcharge de communication est encore réduite en n'envoyant que le minibloc intrasecret aux shards soeurs. Les miniblocs transversaux sont toujours envoyés sur différents sujets accessibles par les nœuds intéressés. En fin de compte, les défis peuvent être relevés par plusieurs nœuds honnêtes. La mise en place de sujets P2P constitue une autre mesure de sécurité. La communication d'une shard vers la métachaîne se fait par un ensemble défini de sujets / canaux, qui peuvent être écoutés par n'importe quel validateur honnête - la métachaîne n'acceptera aucun autre message provenant d'autres canaux. Cette solution introduit un certain retard dans la métachaîne uniquement en cas de sharding, qui sont très peu nombreux et très improbables car, s'ils sont détectés (forte probabilité d'être détectés), les tessons risquent de perdre tout leur enjeu.

source: 5 Shard reorganization
fr: 5 réorganisation des shards

source: 33After each epoch, less than 1 · n of the nodes from each shard are redistributed uniformly and non-deterministically across the other shards, to prevent collusion. This method adds bootstrapping overhead for the nodes that were redistributed, but doesn’t affect liveness as shuffled nodes do not participate in the consensus in the epoch they have been redistributed. The pruning mechanism will decrease this time to a feasible amount, as explained in section IX.2.
fr: Après chaque époque, moins de 1 . n des nœuds de chaque shards sont redistribués de manière uniforme et non déterministe sur les autres tessons, afin d'éviter toute collusion. Cette méthode ajoute un surcoût d'amorçage pour les nœuds qui ont été redistribués, mais n'affecte pas la qualité de vie car les nœuds remaniés ne participent pas au consensus de l'époque à laquelle ils ont été redistribués. Le mécanisme d'élagage diminuera cette fois-ci jusqu'à un montant réalisable, comme expliqué dans la section IX.2.

source: 6 Consensus group selection
fr: 6 Sélection du groupe de consensus

source: After each round a new set of validators are selected using the random seed of the last commited block, current round and the eligible nodes list. In case of network desynchronization due to the delays in message propagation, the protocol has a recovery mechanism, and takes into consideration both the round r and the randomness seed from the last committed block in order to select new consensus groups every round. This avoids forking and allows synchronization on last block. The small time window (round time) in which the validators
fr: Après chaque tour, un nouvel ensemble de validateurs est sélectionné en utilisant la graine aléatoire du dernier bloc validé, le tour en cours et la liste des nœuds éligibles. En cas de désynchronisation du réseau due à des retards dans la propagation des messages, le protocole dispose d'un mécanisme de récupération, et prend en considération à la fois le cycle r et la semence aléatoire du dernier bloc validé afin de sélectionner de nouveaux groupes de consensus à chaque cycle. Cela évite les bifurcations et permet la synchronisation sur le dernier bloc. La petite fenêtre de temps (temps de ronde) dans laquelle les validateurs

source: group is known, minimizes the attack vectors.
fr: est connu, minimise les vecteurs d'attaque.

source: 7 Node rating
fr: 7 Evaluation des nœuds

source: Beside stake, the eligible validator’s rating influences the chances to be selected as part of the consensus group. If the block proposer is honest and its block gets committed to the blockchain, it will have its rating increased, otherwise, it’s rating will be decreased. This way, each possible validator is incentivized to be honest, run the most up-to-date client software version, increase its service availability and thus ensuring the network functions as designed.
fr: Outre l'enjeu, la notation du validateur éligible influence les chances d'être sélectionné dans le cadre du groupe de consensus. Si le ppromoteur de bloc est honnête et que son bloc s'engage dans la Blockchain, sa note sera augmentée, sinon, sa note sera diminuée. De cette façon, chaque validateur possible est incité à être honnête, à utiliser la version la plus récente du logiciel client, à augmenter sa disponibilité de service et à assurer ainsi que le réseau fonctionne comme prévu.

source: 8 Shard redundancy
fr: 8 La redondance des fragments (shards)

source: The nodes that were distributed in sibling shards on the tree’s lowest level (see section IV.4) keep track of each other’s blockchain data and application state. By introducing the concept of shard redundancy, when the number of nodes in the network decreases, some of the sibling shards will need to be merged. The targeted nodes will instantly initiate the process of shard merging.
fr: Les nœuds qui ont été distribués en tessons de frères et sœurs au niveau le plus bas de l'arbre (voir section IV.4) gardent la trace des données de la Blockchain et de l'état de l'application de chacun. En introduisant le concept de redondance des shards, lorsque le nombre de nœuds dans le réseau diminue, certaines des shards soeurs devront être fusionnés. Les nœuds ciblés lanceront instantanément le processus de fusion des shards.

source: XI Understanding the real problems
fr: XI Comprendre les vrais problèmes

source: 1 Centralized vs Decentralized
fr: 1 Centralisé vs Décentralisé

source: Blockchain was initially instantiated as an alternative to the centralized financial system of systems [45]. Even if the freedom and anonymity of distributed architectures remains an undisputed advantage, the performance has to be analyzed at a global scale in a real-world environment.
fr: La blockchain a été initialement instanciée comme alternative au système financier centralisé des systèmes [45]. Même si la liberté et l'anonymat des architectures distribuées restent un avantage incontesté, les performances doivent être analysées à l'échelle mondiale dans un environnement réel.

source: The most relevant metric measuring performance is transac-
fr: La mesure la plus pertinente de la performance est le nombre de transactions par seconde (TPS), comme le montre le tableau 2. Une comparaison des transactions par seconde entre les systèmes centralisés traditionnels et les nouvelles architectures décentralisées, dont la fiabilité et l'efficacité ont été validées à grande échelle, reflète une réalité objective mais troublante [46], [47], [48], [49]

source: tions per second (TPS), as seen in Table 2. A TPS comparison of traditional centralized systems with decentralized novel architectures that were validated as trusted and efficient on a large scale, reflects an objective yet unsettling reality [46], [47], [48], [49].
fr: [ABOVE]

source: The scalability of blockchain architectures is a critical
fr: La scalabilité des architectures en BlockChains est un problème critique mais toujours non résolu. Prenons, par exemple, l'exemple de la détermination des implications en matière de stockage des données et de bootstrapping des architectures de blockchain actuelles qui se mettraient soudainement à fonctionner au même niveau de débit que Visa. En procédant à de tels exercices, l'ampleur des multiples problèmes secondaires devient évidente (voir la figure 11).

source: but still unsolved problem. Take, for instance, the example determining the data storage and bootstrapping implications of current blockchain architectures suddenly functioning at Visa level throughput. By performing such exercises, the magnitude of multiple secondary problems becomes obvious (see Fig.
fr: <Voir 287>

source: XII The blockchain performance paradigm
fr: XII Le paradigme de performance blockchain

source: The process of designing distributed architectures on blockchain faces several challenges, perhaps one of the most challenging being the struggle to maintain operability under contextual pressure conditions. The main components that determine the performance pressure are:
fr: Le processus de conception d'architectures distribuées sur Blockchain fait face à plusieurs défis, peut-être l'un des plus difficiles étant la lutte pour maintenir l'opérabilité dans des conditions de pression propres au contexte. Les principaux composants qui déterminent la pression de performance sont :

source: • complexity
fr: • complexité

source: • system size
fr: • taille du système

source: • transaction volume
fr: • volume des transactions

source: Complexity
fr: Complexité

source: The first element that limits the system performance, is the consensus protocol. A more complicated protocol determines a bigger hotspot. In PoW consensus architectures a big perfor- mance penalty is induced by the mining complexity that aims to keep the system decentralized and ASIC resilient [50]. To overrun this problem PoS makes a trade-off, simplifies the network management by concentrating the computing power to a subset of the network, but yields more complexity on the control mechanism.
fr: Le premier élément qui limite les performances du système, est le protocole de consensus. Un protocole plus compliqué détermine un point critique plus gros. Dans les architectures consensuelles de PoW, une grande pénalité de performance est induite par la complexité de l'exploitation qui vise à maintenir le système décentralisé et la résilience des ASIC [50]. Pour surmonter ce problème, le PoS fait un compromis, simplifie la gestion du réseau en concentrant la puissance de calcul sur un sous-ensemble du réseau, mais apporte plus de complexité au mécanisme de contrôle.

source: Distributed
fr: Distribué

source: TPS (average)
fr: TPS (moyenne)

source: TPS (max limit)
fr: TPS (limite maximale)

source: System size
fr: Taille du système

source: Expanding the number of nodes in existing validated architectures forces a serious performance degradation and induces
fr: L'augmentation du nombre de nœuds dans les architectures validées existantes entraîne une grave dégradation des performances et induit

source: virtualization
fr: virtualisation

source: Distributed virtualization Private Blockchain Private Blockchain Public Blockchain Public
fr: Virtualisation distribuée Blockchain privée Blockchain privé publique Blockchain publique

source: Centralized 3500 55000
fr: Centralisé 3500 55000

source: Centralized 200 450
fr: Centralisé 200 450

source: Permissioned 1500 55000
fr: Avec permission 1500 55000

source: Mixed 1000 10000
fr: Mixte 1000 10000

source: Decentralized 15 25
fr: Décentralisé 15 25

source: Decentralized 2 7
fr: Décentralisé 2 7

source: a higher computational price that must be paid. Sharding seems to be a good approach, but the shard size plays a major role. Smaller shards are agile but more likely to be affected by malicious groups, bigger shards are safer, but their reconfiguration affects the system liveness.
fr: un prix de calcul plus élevé qui doit être payé. Les Shards semblent être une bonne approche, mais la taille des Shards joue un rôle majeur. Les Shards plus petits sont agiles mais plus susceptibles d'être affectés par des groupes malveillants, les Shards plus gros sont plus sûrs, mais leur reconfiguration affecte la viabilité du système.

source: With a higher relevance compared to the others, the last item on the list represents the transaction processing performance. In order to correctly measure the impact of this criteria, this must be analyzed considering the following two standpoints:
fr: Plus pertinent que les autres, le dernier élément de la liste concerne les performances de traitement des transactions. Afin de mesurer correctement l'impact de ce critère, celui-ci doit être analysé selon les deux points de vue suivants :

source: TABLE 2: Centralized vs Decentralized TPS comparison
fr: TABLEAU 2 : Comparaison des TPS entre une architecture centralisée et décentralisée

source: • C1 transaction throughput - how many transactions a system can process per time unit, known as TPS, an output of a system [51];
fr: C1 Débit des transactions - combien de transactions un système peut traiter par unité de temps, connue sous le nom de TPS, en sortie d'un système donné [51] ;

source: • C2 transaction finality - how fast one particular trans- action is processed, referring to the interval between its launch and its finalization - an input to output path.
fr: - C2 Finalité de la transaction - la vitesse à laquelle une action particulière est traitée, en se référant à l'intervalle entre son lancement et sa finalisation - depuis l'entrée vers la sortie.

source: C1. T ransaction throughput in single chain architectures is very low and can be increased by using workarounds such as sidechain [52]. In a sharded architecture like ours, the transaction throughput is influenced by the number of shards, the computing capabilities of the validators/block proposers and the messaging infrastructure [8]. In general, as displayed in Fig. 13, this goes well to the public, but despite the importance of the metric, it provides only a fragmented view. C2. T ransaction finality - A more delicate aspect that emphasizes that even if the system may have a throughput of 1000 TPS, it may take a while to process a particular transac- tion. Beside the computing capabilities of the validators/block proposers and the messaging infrastructure, the transaction finality is mainly affected by the dispatching algorithm (when the decision is made) and the routing protocol (where should the transaction be executed). Most of the existing state of the art architectures refuse to mention this aspect but from a user standpoint this is extremely important. This is displayed in
fr: C1. Le débit de transactions dans les architectures à chaîne unique est très faible et peut être augmenté en utilisant des solutions de contournement telles que la chaîne latérale [52]. Dans une architecture en Shards comme la nôtre, le débit de transaction est influencé par le nombre de Shards, les capacités de calcul des validateurs/proposeurs de blocs et l'infrastructure de messagerie [8]. En général, comme le montre la figure 13, cela va bien au public, mais malgré l'importance de la métrique, cela ne donne qu'une vue fragmentée. C2. Finalité de la transaction - Un aspect plus délicat qui souligne que même si le système peut avoir un débit de 1000 TPS, il peut prendre un certain temps pour traiter une transaction particulière. Outre les capacités de calcul des validateurs/proposeurs de bloc et l'infrastructure de messagerie, la finalité de la transaction est principalement affectée par l'algorithme de répartition (lorsque la décision est prise) et le protocole de routage (où la transaction doit-elle être exécutée). La plupart des architectures de pointe existantes refusent de mentionner cet aspect, mais du point de vue de l'utilisateur, il est extrêmement important. C'est ce qu'illustre la figure 14, où le temps total nécessaire pour exécuter une certaine transaction du début à la fin est pris en compte.

source: Fig. 11: Storage Estimation - Validated distributed architectures working at an average of VISA TPS
fr: Fig. 11 : Estimation du stockage - Architectures distribuées validées pour un fonctionnant à une moyenne du TPS VISA

source: Fig. 13: Transaction throughput
fr: Fig. 13 : Débit des transactions

source: Fig. 14, where the total time required to execute a certain transaction from start to end is considered.
fr: <cf 321>

source: In Elrond, the dispatching mechanism (detailed in section V) allows an improved time to finality by routing the transactions directly to the right shard, mitigating the overall delays.
fr: À Elrond, le mécanisme de répartition (détaillé dans la section V) permet d'améliorer le délai de traitement en acheminant les transactions directement vers le bon tesson, ce qui réduit les délais globaux.

source: Performance tests and simulations, presented in Fig. 12, reflect the efficiency of the solution as a highly scalable distributed ledger. As more and more nodes join the network our sharding approach shows a linearly increasing throughput. The chosen consensus model involves multiple communication rounds, thus the result is highly influenced by the network quality (speed, latency, availability). Simulations using our testnet using worldwide network speed averages, at its max- imum theoretical limit, suggest Elrond exceeds the average VISA level with just 2 shards, and approaches peak VISA level with 16 shards.
fr: Les tests et simulations de performance, présentés à la figure 12, reflètent l'efficacité de la solution en tant que registre distribué hautement scalable. Comme de plus en plus de nœuds rejoignent le réseau, notre approche de Sharding démontre une augmentation linéaire du débit. Le modèle de consensus choisi implique de multiples tours de communication, le résultat est donc fortement influencé par la qualité du réseau (vitesse, latence, disponibilité). Les simulations réalisées avec notre testnet en utilisant les moyennes de vitesse du réseau mondial, à sa limite théorique maximale, suggèrent qu'Elrond dépasse le niveau VISA moyen avec seulement 2 Shards, et se rapproche du niveau VISA maximum avec 16 Shards.

source: Fig. 14: Transaction finality
fr: Fig. 14 : Finalité de la transaction

source: 2 Ongoing and future research
fr: Recherche actuelle et future

source: Our team is constantly re-evaluating and improving Elrond’s design, in an effort to make this one of the most com- pelling public blockchain architectures; solving scalability via adaptive state sharding, while maintaining security and high energy efficiency through a secure Proof of Stake consensus mechanism. Some of our next directions of improvement include:
fr: Notre équipe réévalue et améliore constamment la conception d'Elrond, afin d'en faire l'une des architectures de BlockChain publique des plus prometteuses ; elle résout le problème de la sclabilité par le Sharding d'état adaptatif, tout en maintenant la sécurité et une haute efficacité énergétique grâce à un mécanisme sécurisé de consensus de preuve d'enjeux. Voici quelques-unes de nos prochaines orientations en matière d'amélioration :
